{
    "props": {
        "pageProps": {
            "query": {
                "id": "1227036de9d544ae9ebbcc3a9c7808a8"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 85481,
                "outId": "1227036de9d544ae9ebbcc3a9c7808a8",
                "articleOutId": "1227036de9d544ae9ebbcc3a9c7808a8",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Luis, you and I have been talking, and we wanted to revisit it here as well, about within a format how a different card can have different impacts on different archetypes. But Matt's question zooms us out one step to the format level and how similar cards can go from being just fine to being amazing. What do you make of that?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Yeah, there are definitely context differences that, of course, will impact this dramatically. There are some cards that are pretty much good every format. Scorching Dragonfire might be better here than in most because there are so many enduring things you need to exile or death triggers. But the 2 mana instant deal 3 with minor upside or even no upside has just always been one of the top red commons every format it's ever been in. It goes up and down a little bit, but not by much. That said, there's a lot of cards that someone can be great in a format and some can only be mediocre. And I think the speed of the format, what the stat lines are of the common creatures,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">whether the format is a lot of removal or a small amount of removal, all that stuff goes together. And also what color is good. I would generally say 2 mana white for a 2/1 flyer draw card is going to be better than 2/1 flyer draw card because white is just going to use that body better. White is going to be more aggressive. White is going to care about having an aggressive flyer more often. How good would Piranha Fly in this format be if it was red or if it was white? It would be awesome. In blue, sometimes it's good, but it's often not. And that's kind of where you look at similar cards and why there's probably pretty different amounts of impact they have.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">What do you think, Paul? Yeah, I mean, it just makes a lot of sense. One of the big things for me is, I guess, creature sizing. And after you play with the set for a couple of weeks, you start to realize what toughness and what power are relevant in this format. For example, in Dustmourne, there's a bunch of 2/2s running around, right? Because you have a bunch of manifest. So in that instance, shock effects go up in value, whereas in other sets where people are just kind of playing 3 mana 3/3s and 3 mana 3/4s, shock becomes a card you play, but you're not as excited to play.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So sizing, I think that's a big level up moment for me in any set. Once I start realizing, oh, man, like if I play four toughness creatures and everything else is a three power creature, then I know people are undervaluing this card. Whereas I'm going to take this card and it's going to have a much better impact on the board just because of the sizing of the creatures. Yeah, it's also cool. I mean, it's good job security for us, right? Because the fact that you can, like we could read Organ Hoarder and go, yeah, this looks pretty solid, C+, whatever, you know, and because that's kind of the context that we have during a set review and have it be end up being the best common in the set,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">you know, significant bump up means that it is still hard to predict these things. We don't get a cheat code that just tells us this is going to be good. And, you know, we've seen that with cards that we've talked about more recently with the classic one in a green, look at some cards, get something back. And now they tend to maybe even give you a little bit of onboard presence and something like that. And those have skyrocketed where traditionally those were fringe playables at best for a very, very long time. They were kind of just spinning your wheels,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">but not just kind of wasting mana. And as the game became more efficient, as the average creature got better, as the average card got better, it limited those type of cards went down because it was like, well, you're just always drawing gas anyway, you don't really need to like search for something specific. But then once they kicked in a little something, you know, just a little old one that you can make mana with or, you know, a food token or something, it was like, oh, now these are right back near the top.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It makes these things difficult to predict. And I mean, that's, of course, you know, why we're here is to is to predict these things. That's a really good question, Matt. Thanks for that. Let's do a couple of cracker packs, gentlemen. I, you know, this is a really good spot in the format, you know, for all of us to kind of throw our two cents in about what we've been thinking and, and how we've been approaching the format. So I will bring up our first cracker pack, where we have, I'm just gonna ignore the foil, actually,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">because I think that it just gives you one. Our first card out is Malevolent Chandelier. That's the six mana four four flyer that you can sorcery speed put stuff on the bottom of somebody's library from a graveyard. I, I really only play this in blue green is the only deck I've played it in so far and, or like black green, but most most commonly blue green. And I think I play it maybe a third of the times that I'm in a deck like that. What it's useful for is just have like kind of like a one card stopgap of I'm not going to deck myself, especially if you have multiple ways to bring it back from the graveyard, which these decks typically do.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So you end up, you can early on, you know, mill it or manifest it, you don't care, you just know you have this card in your graveyard at some point. And so then you cast under the skin or say its name, so you don't get decked, and you get it back and you put a card or two on the bottom. The fact that it's sorcery speed really does make it a little tougher to loop, just because you can't like start the turn with no cards in your deck and then upkeep put a card back. But again, like I mentioned last week, that was because messing with their graveyard instant speed would be really annoying.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Paul, how often are you playing the chandelier? Pretty rarely. Again, this is a card I would basically only play in blue green because that deck just has the ability to turn through its deck super quickly with oblivious bookworms and all the manifest cards. And in that instance, I think I've only played it maybe like once. Oftentimes, I prefer playing cathartic parting, just because that's just a good disenchant effect that also shuffles some things back in. But noting that cathartic parting is a little bit less reliable, because if you're playing a deck with a bunch of manifests, if you just manifest the way the cathartic parting,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">you're not able to shuffle it back in. Whereas if you're a blue green deck, you're going to manifest this a lot of the time. And if you do, you know that over the course of a game, you'll probably be able to flip this over and start shuffling things in. That being said, getting like the ultimate manifest self mill deck, a lot of the time those decks are going to be so good, you're probably going to win. But oftentimes, a lot of those times I find myself winning with like three or four cards left.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">But of course, having this is a little bit of a kind of insurance. But at the same time, you're kind of playing a really expensive, inefficient creature at the same time. It's not free to play this card. If this card is in your opener, you're just like, well, I kind of mulliganed. So I think I would put it in the absolute best versions of my blue green decks that turns through its deck super quickly. But outside of that, I'm not really interested in this. Yeah, I don't end up playing it. I always have it earmarked in my mind of like,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I could have this as a backup plan. But then I'm like, well, I'm not a coward. So I just don't play it. I don't need insurance, Thales. That's fair. That's fair. I mean, I probably lose some percentage of it, but it has to be worse to have this in your deck overall, right? I don't think so. The thing is, when you have a deck that, let's say,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">has two or three say your names and an under the skin and like seven ways to manifest, the odds that you actually have to draw this card are just not that high. Yeah, that's true. And you get to have that. Plus, it's an artifact creature. When you mill it early, it counts for two types. Yeah, you could also do worse than a six mana four four flyer. Yeah, I mean, sometimes people play it and I'm like, I'm going to lose to it because it hit me in the air three times. Yeah,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">manifesting it is also great because like you get to just flip it up and, you know, just out of nowhere, you've got four four flyer. So, look, I don't think the card is great, but I think it's good. It's the exact kind of card you want to know when you should use it. You'll get some percentage out of doing so. Found footage is next. Speaking of card I never play, this is the one mana clue. You can look at face down creatures from your opponents and you can pay two. Oh, you never play this card? I don't ever play it.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">You can pay two and saca to surveil two and draw a card. I don't ever play it. I know Luis is a delirium enjoyer, so I'm sure he's put plenty of this card in his deck. I prefer to get delirium in other ways, but if you absolutely need to find a way, you can play this card. But of course, you know, say its name is just a better version of this card. And I also really like taking cards like manifest dread, which also just helps you kind of get turbo delirium.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">And most of my delirium decks kind of tend to be green based, so I typically don't look to play this card. I can count on one hand probably the number of times I played this card. What about you Luis? You sounded surprised. Do you end up running this somewhat sometimes or? Yeah, definitely. Look, I'm not saying it's a great card, but when you've got a delirium deck that really does need to hit delirium, if you don't have a couple artifacts to play,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">then this is a totally fine one to put in your deck. Look, yeah, I'd rather my jung delirium decks have like the wicker tree folk or a piggy bank or the four mana five four. All those cards are good. Conductive machete, glimmer light. Great. Found footage is just a way to get your like second or third artifact into a deck that really wants to mill it. And it helps by putting stuff in the graveyard. So I'm not saying the card is great, much like the chandelier, but there are times when it is good to run this card.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Okay. Yeah, I think that like I definitely recognize that and I always have it in the back of my head. But when either drafting or deck building, I never I never find myself with like, okay, here it is. This is the perfect spot for a found footage to make it in. Maybe I'm just being a little bit too much of a stickler on it. Because I mean, yeah, there's nothing wrong with the card. It's it's perfectly reasonable, you know, for what you get. I just, it ends up in the sideboard every time for some reason.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Next is vicious clown. That's the two and a red two, three and whenever another creature with power two or less enters, it gets plus two plus zero. And it doesn't have a cap on that you can you can kind of pop off with it. Yeah, playable card in red white, but I played in red. Not. That's it. But not a really good card. Certainly not one you have to take early. Yeah. Is that where you're at?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Oh, that's, that's, yeah, I mean, you get kind of any The thing is the three mana creatures at common and red white are all kind of bad. So, or not bad, but they're all kind of mediocre and they're all kind of replacement level. So any combination of vicious clown or hardened escort, like they're all kind of similar and win rate that they're both fine. But those are all cards, you kind of get eighth and ninth pick that just kind of fill kind of the curve, the hole in your curve at three acrobatic cheerleader. That's the one in a white to two and it has survival it gets flying.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So counter playable card, it can be good sometimes, but it's not a card you need to prioritize. I don't think either. Yeah, I'm a little down on it from where I was earlier. I think I had it a little bit higher. When the set first came out. I've drafted a lot of red white now, and acrobatic cheerleader always makes the cut, but I I'm prioritizing it. Pretty low, pretty low and draft. Well, it's also I mean,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I think a good way to look at all these is if you took an early acrobatic cheerleader, which normally wouldn't take that specific card early, but just looking at that card, if you're picking that card, well, it's good in red white or at least playable in red white. I wouldn't even think it's great. It's not good in blue white. No, white green is best avoided, which would be its natural home because it's a survivor and it would have the support for it. And then black white certainly doesn't want it. So it's it's a card that doesn't have very many homes.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It's not even that important in the places where you do. Take it. So that's a yeah, I don't I I certainly don't prioritize it. I mean, this format is really cool. One of the reasons I think this format is so sweet is that there's wildly divergent win rates when you have cards in different decks. We were kind of talking about this a little before the show. But like if you look at like how good yeah, card like even acrobatic cheerleader is in exactly red white, the card can do some good work, but it's not very good outside of that. And then there's a lot of cards like that where you can get a lot of cards that are not good.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Like that where their win rates go up or down like final vengeance Paul was mentioning is he's got really good stats in red, black and is terrible outside of that. And yeah, that's kind of been my experience too. Yeah. Yeah. The cheerleader, it just, you know, it really does need to come down on turn two. And then what usually happens is it just highly incentive incentivizes them to trade, which they usually just do. It's actually quite rare for it to pick up the counter because people are just like, sure, I'll trade off with with something spectral snatcher.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">This is the the black swamp cycler. So the four black, black six five with ward, discard a card. There are reasons to play these cards in your deck. I like some of them. I like the green one actually a fair amount. The black one's fine too because it's in a color that can use delirium or has ways to reanimate it. But you just don't have to prioritize these really. Yeah. I was hoping that the black white would really want this card and be able to reanimate it effectively. But that deck has proven to be very shaky and this hasn't proven to be a big part of the equation. Yeah. I'm generally just very low on the land cyclers in general.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I just never take them highly to manna to land cycle is just such a big difference from some of the one man and man land cyclers that we've seen in the past. Every color has access to a ton of two men of plays. So if you're ever on the draw and you land cycle against like a red white that good luck. You're right. You're just you're just dead. So for that reason, I just don't prioritize it that highly. But notably, the green and black ones are a little better. Just green one. Just if you need a you know, if you need just a giant green monster in your deck, you can just play it.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">And then the black one just because every now and then you have the ability to reanimate it with like a valve of God's faithful or something like that. But again, both of those cars are just I've cut them plenty of times too. So I just never take them highly. Yeah, you want to lose to a vicious clown. Try try to land cycling on turn two. Next is creeping peeper. That's the one in a blue to one and it adds blue manna to cast enchantments, unlock doors, or turn permanents face up. I have not been playing much creeping peeper. Where are you guys at on it?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I mean, it's it's got its its its moments like if you are where do you like it? If you're in like, white, blue or blue, red or blue green, and you just have a lot of enchantments and needed to drop it's a totally fine card. Is that where you're at Paul? I just don't play this card. Usually, I think probably blue red is where it's maybe at its best just because that's kind of the rooms deck. So you're just going to have you're just going to really want to utilize that manna a lot even in blue white. Oftentimes, you'll just not have necessarily things to do sometimes,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">you know, your your glimmer bursts and tunnel surveyors don't yet it doesn't generate mana for any of those creatures either. So generally, the two drop that I kind of avoid playing I mean, if you you'll know when this card is going to be fine in your deck. But it'll never be an all star. Right. I think I think that some of this is a symptom of how much I've been drafting that like, the more you draft you get to like the tail ends of like sometimes these these cards are playable. Because I certainly don't want the takeaway here that I love found footage malevolent chandelier and then the creeper. Lock it in.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I'm just saying I've run into situations where they have some utility. Yeah, well, I mean, I think it's useful for you to like, there might be an opportunity for you to say like two different things here, which is one of them is how much do you actually run these cards? Right? Like, I don't ever play found footage. I almost never played creeping people and I effectively never play chandelier. I think I put it into one deck. So that's like my reality, though. I agree with all of the things that you said about all of them,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">that there could be spots or I always keep my eye open or, you know, if the question is, where would this card be good or when it is good? What does that look like? Go ahead. I had a I had a blue green deck that had a threats around every corner, like growing dread to meat lockers to underwater tunnels. And I had you know, because I had like a paranormal analyst and oblivious bookworm and, you know, lots of manifest in the people could rant me to four for the like threats around every corner could just incidentally cast a lot of my cards.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So you just end up in a spot where it's relevantly tapping for mana enough of the time that I'm willing to put it in the deck. But what about like, what if I took the last five blue white decks that you drafted? Would it have any of these in it? I had it in one deck that had a the mind Skinner, the blue, blue, blue 10 one. And that's like a way to get the third blue for that for fairly well. And then Jim and Yeah, and I just had a lot of rooms my deck and it does are mana intensive. But I would say like,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I'm probably gonna play creeping people in blue white, like a quarter to a fifth of the time, which is not that. Yeah, okay. It's not a very good card. Yeah. Because I think that's a good way to get the takeaway where you want it to be, which is that, you know, you're you're recognizing where it should go. But maybe that it doesn't always, it rarely actually happens or whatever. Anthropid is next. That's the three in a green three, four with reach.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">And you can pay two when you cast it or sorry, when, when it enters, or you can discard a card and it destroys a room. I played this like the first couple days of the format, then I stopped playing it and I haven't played either. Yeah. The problem is if you get a room, they already got value from their room. They played it, they cast glassworks, you're not getting them by killing the glassworks afterwards and discarding a card, right? So it's just oftentimes the I mean, you're playing a four mana three,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">four reach creature and you're breaking even on cards or down a card or whatever. So that that's why it's just if it's kind of like, you know, if you can somehow like if you kill a room, you get some value, you scry or something, maybe it's it's fine. But just the fact that it just full stop just kills a room, but there's like an additional cost to do so. I just I just I've never put this in my deck. Yeah, you know, you read this card and it seems fine. But like when you actually lay out the use cases, it's not right. It's like, how would you like to play six mana for a three,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">four reach that blows up half the bad half of a value card that your opponent played? So well, I doesn't sound very good. And it's like, well, how about this then right now I'm going to discard a card like I'm a whole card like and again, it's the argument for this is that you can discard whatever type you need for delirium. I think is like the biggest reason to include this, but that's not worth it. Delirium is supported well enough in other places that this is not one place you need to go. Yeah. And by the way,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">this is a really great example of the type of card that is illustrative of where limited is at now. Like we're just bashing this thing, right? It's a four mana three, four reach with upside. Right. We're just like so many limited formats were forming a three, four reach would be one of the top green cards. It was two green, green, wasn't it? There was like a cloud crest oak and that was like a solid creature. Totally. And this one's easier to cast.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">And by the way, all of the extra room stuff is just completely optional. Like we have to do it anyway. I'm really glad that we opened this next card because I want to get your guys take on it because I've tried and haven't really been able to make it work, which is scrabbling skull crab, the blue zero three with eerie somebody Mills two cards. What's the, so a, have you guys been able to make this work? We'll start with you, Louise and B if so, what's it's what, how do you use it? You put it in a deck with lots of enchantments. Come on, come on.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Because, uh, the rooms give it multiple triggers so you get a lot of value out of it. And I have liked it best in blue white because, uh, you know, the grand entryway elegant rotunda combo is a sick one where you play when you play the grand entryway, you get to build them for forwards. That, that part's great. Uh, but I think it is, it is fine in blue, green or blue, red. I've had it in all those decks. I honestly, I don't think I've drafted straight blue, black, like a single time.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">No, I drafted it exactly one time and it was not, and it didn't go well. And I never really have bought it once and I went seven one. I never went back. I was like, I proved my point. I'm done. Yeah, I had a lot. So, so you're, so you're talking about getting value and all that. Like, are you talking about million your opponent out? Totally. I, I, I think that these decks,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">like I would say your average blue white deck should just put a skull crab in it. Like if you had the option to add a skull crab at the end, you would, you would, you would do that. Yeah. It look, look at how often you're milling yourself in this format. Well, that's what I'm, that's why I asked if you're milling your opponent out and you said, yeah, look at how often you are playing a deck that mills itself in this form. I understand you're paying it very frequently. Sometimes a skull crab is just going to be threatening without doing that much.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It was pretty scary for, for the delirium or whatever deck to see a skull crab. No, it really is. Like your opponent plays a turn one skull crab and you're playing like salt eye and you're just like, Oh, I got to kill that thing. Cause even if it mills me for like six or something or eight, I still might be in an awkward spot cause my cards need to also be doing that. Like you're just going to not cast your say it's names, you know, and every manifest is two cards off the deck. Like I, I, I would not always play it in blue green.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I've certainly not many times, but I think it's, if you know your blue white, like if after pack one, your blue white and you're pretty heavily blue and you open the skull crab and pack two, you should usually take it. Like it is, it is I think a very good card. I've just had such a hard time converting. Like it feels to me that like when, when it didn't matter, right. Meaning my opponent wasn't milling themselves and it was going to take a lot, like this was really the only thing I had that could, that could mill them out.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Then they would ignore it. And it's pretty ignorable as a, as an O three. And when it did, they're like, okay, fine. I'll, I'll, you know, I'll kill it. And like, yeah, you know, it's still a one for one, whatever. Right. So it, I've just found it to be unreliable in that way. Cause you know, I mean, if I mill half their deck, I probably help them. If I know all of it, then I win. It's like a, there's that uncomfortable middle ground.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I think what this card is like, it costs just one minute. So if you play this, mill them for four, then they kill it. Usually you got at the very least a mana advantage. For sure. It can block two twos just fine. Like that, that is definitely a part of the card and it can, it can also just mill really hard sometimes like in blue, white, especially like I've had games where I didn't draw this card till kind of late play it, mill them for six in the same turn. And then if it untaps on mill for another bunch, cause the,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">the room is not only besides milling them a bunch, each one meat locker draws you more cards. Sometimes the bottomless pool locker room draws you more cards and you end up having a lot of ways to enable it. I don't think it's very common that it's going to be good at blue, green. I feel like blue, green, it focuses on manifest and has a lot of non enchantments in the deck and blue, red. I just, I don't draft that often. Like I've had some really good blue, red decks, but I do think the color pair is on the weaker side.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So I mostly see the skull crab as a blue, white card, but I think it's a pretty solid one. What do you think, Paul? I don't think I've put this card in my deck, but I also haven't really been drafting blue, white that often. Not because I don't think blue, white is good, but it's overdrafted because it's really easy. It's really easy to draft blue, white too. It's like, Oh, this is an enchantment or, Oh, this has eerie. I'm going to draft it.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So because of how powerful and easy it is to draft, I think a lot of people do that. So I've been kind of skewing towards the multicolor green decks just because those are harder to draft and they tend to be open a little bit more. So I can see the argument for this card being good in a very enchantment heavy blue, white deck, particularly if you're kind of more of a, maybe not as aggressive of a deck. The nice thing about blue, white is there's kind of multiple types of blue, white decks you can build. You can build kind of the super aggressive tempo we build.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">There's a blue, white tempo deck with unnerving grasps and you just try to go off with gremlin tamers and beat them down. Maybe in that type of deck, you don't want a skull crab. Maybe you just want another two mana creature or something that helps you push through damage. But if you're playing maybe more of a controlling deck with meat lockers and glimmer bursts and have a lot of card draw and defensive cards, you know, five unable to screams or whatever and a bunch of crabs, that can be a legitimate way to win. So I can see both things. I will say it's probably the the nightmare matchup for this card is that red green aggressive delirium deck where you just play that crab turn one. They're like wicker folk you wicker like turn.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Yeah, yeah, they will definitely wicker folk you up there. But turn two hand that feeds is going to be a real problem. You're like, am I supposed to mill you here or not? Yeah, totally. Look, one thing I do want to caution you about, though, you don't need a deck with multiple crabs and five unable to screams. One crab in most blue, white decks is just a playable card. That has been my experience and playing against it. When a blue, white deck plays a crab, I usually am like, yeah, I guess I should deal with that thing.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Okay, yeah, I was about ready to get off of the train here because I've taken a few stabs at it and it just hasn't quite panned out. But all right, I'll stay on. You convinced me, Luis. I'll keep going at it with the scrabbling skull crab. By the way, man, we got three bangers here for blue, especially for the enchantments deck, blue, white, etc. Next one is stay hidden, stay silent. That's the one in a blue aura that enchants a creature. It taps a creature, the creature doesn't untap, and you can pay four blue, blue to shuffle the enchanted creature into the owner's library at sorcery speed and you manifest dread as well.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It's a nice card. This is just a premium removal spell. Definitely the pick so far out of the pack that we've seen. Just full stop, two mana, kill something. And then in the really late game, you also just get to shuffle it in and make a two, two. There's not much more you can ask for. One of the better removal spells in the format. Yeah, the only caveat is don't do it on a survival creature, but yes, not not not an effective answer to their survival creature.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">That did happen to me. And this next one is another card that's awesome. And in this same space and its fear of isolation, the one in a blue two, three enchantment creature is got flying and as an additional cost to cast it. It's funny that they call it a cost in this case because it really isn't. But you return a permanent you control to its owner's hand. Love fear of isolation. I found so many sweet things to do with this card. Cards insane. Cards absolutely insane.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">There's just you just don't run out of things to bounce. Right. Never. I mean, not only are you able to pick up things with stay hidden, stay silent or unable to scream or any of those things, but just resetting your rooms, even just bouncing a glimmer light. There's just all kinds of things you can do with this card on just a really nice body. Two mana, two, three flyer. This is a card I first picked many times. So.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Oh, yeah, it's a first pickable card. I mean, but I had a deck that had two of these and a roller crusher ride. And like that was just. I guess that's a good one. Although how many times do you need to roll a piece? Do you do like a mini one and then a big one later? I'll be honest, I never actually picked it up. That deck also had three growing dreads. I mostly were just picking those up. Turn two, growing dread.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Turn three, fear of isolation. Pick up growing dread. Turn four, growing dread. Play second fear of isolation. Pick up growing dread. You know, and you're just they're just done. That's a joke. Yeah. And I think that you touched on it, Paul, but the really crazy thing about the card is just that it's a great buy.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It's a two, three with flying like that. Yeah. This is a bit of a throwback design in that way and that, you know, it looks like it has a drawback, but it doesn't. It's actually a benefit in this case. This would definitely be top of my list for this pack. Our last uncommon is Lionheart Glimmer. That's a three white, white, two, five with Ward two. It's also an enchantment creature. And whenever you attack creatures, you control get plus one,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">plus one and turn. It's fine. It's a strong card. Yeah. It costs five, right? It costs five. So it's it's a fine card to have at the top end of your curve. But, you know, in red white decks that are looking to go wide, let's you got some Midnight Mayhems and some twins or blue white with a bunch of tunnel surveyors. And once again, twins.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It's a nice card to just kind of have at the top end of your curve. But he keeps saying twins, Paul. The manifest twins. The manifest twins. He's trying to manifest something, Louise. Oh, right. Yes, the twins. Anyways, good with the twins. And but, you know, it's it's a solid card, but I still don't necessarily take it super highly just because there's so much stuff to do with your mana in this format. So I just kind of put a lower priority on anything that costs four or more mana.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Yeah, same. Our our rare is Thorn Spire Verge. The green red kind of dual land thing, which is fine. But yeah, Fear of Isolation. Yep. So I'm taking. Yeah. Yeah. OK, let's do our next crack a pack. This one, I get I'm just going to ignore. I just don't I think these things, this thing that I'm using just puts a foil in every time someone ignore it.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">First card out is Neglected Manor. This is the black white 13 or less lifeland. I well, I don't like black white that much. So this land wouldn't be a priority regardless. Obviously, we'd hope to never be first picking one of these lands. Though I do like the teamer ones a lot. I mean, I like all of them if you're those colors. I found myself playing teamer like a lot more than I would have expected. Oh, yeah. All three.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Timer is the new blue white. She owns for me. That's all like that's that's my highest win rate. Yeah, it's my highest win rate color combination. It's like at around 70 percent and I've drafted it like over 10 times. So. Timer land maybe. Yeah. What about Mulderine Gym weight room? Mulderine Gym is, you know, you can ramp it growth for three and then and then weight room is you get a manifest with two counter or three counters on it. So there's a lot of good.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Manifixing in this format, you have, of course, like the centipede and threats around every corner at uncommon. This one I don't like as much and I will typically play this if I need to splash. So if I am in Timer right, then you're going to have some manifest energies to go with the five five that you get. And then, of course, that allows you to get your color. But I like it significantly less than any of the other Manifixing cards. So I would hate to first pick this. I would sometimes play a copy of this if I'm three or four colors and trying to go a little deep in my my green based decks. Louis, you hit the gym or what?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I basically agree with Paul on this, like it is it is better when you're three colors, if you're two colors, sometimes you'll run it, but you would prefer not to. And overall, it's a totally fine card. The other reason I would end up running this is if I've got some bookworms and paranormal analysts, some some good manifest payoffs. And this is just like an extra way to do that. Yeah, because it is a good one. You get a big manifest creature out of the deal. You do.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">But this is still not a card that that I that I feel like you need to prioritize. Yeah, that's how I feel, too. Fear of immobility. This is the four and a white four four. And when it enters, you tap up to one target creature. If an opponent controls that creature, excuse me, you put a stun counter on it and it's also an enchantment creature itself. This card's actually been better than I thought it like I run one of these routinely in both red, white and blue, white. Yeah, I think it's a totally playable five.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">The main issue for me is that you don't really have to prioritize five drops that often in general. So I'm just not going out of my way to try to pick this card up usually. What about you, Paul? You fear of immobility guy? I mean, I'll play it if I need kind of something at the top end of my curve, if I don't have anything better. It's a little bit nicer in blue, white, obviously, just because you have some of the synergies. And then, of course, if you have the two three two drop glimmer,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">being able to play this on turn four is kind of a beating total. Right. So that's that's kind of the dream that you want to live. There you go. Yeah. Yeah. If you if you're going to do coverage, then it'd be good to know the name. You know, what's funny is I know it's got the name glimmer on it. Yeah. But like, but no, in my in my mind, I'm like for a while, I just thought only the one one tokens were glimmers.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So there are those. So you're like, so they're like the three three survival card. I drew a card. I'm like, where's my token? Right. And it's just because I had the two three in play and I just didn't think that it was an actual glimmer. Anyways, it's a glimmer. But yeah, fear of fear of immobility gives you just enough like it has just enough stats, just enough board impact and just enough synergy to make the cut. Sometimes next is stocked researcher.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">This is the one in a blue three three with defender and it has eerie. It can attack as though it didn't have defender. I like this card. These card. Yeah. In blue, white, especially because you can you know how you guys mentioned there's like there's the aggressive blue, the controlling blue. Well, you know what? This is great in both in the controlling one.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It doesn't even have a drawback. And in the aggressive one, it almost doesn't because that deck just cast an enchantment every turn anyway. Totally. Yeah. I like the stock researcher. This is one of the rewards for being in blue, white or sometimes blue green and sometimes blue red, I guess. But mostly in blue white where at some point you're just going to be getting this with three or four cards in the pack in most drafts. Yeah. Do you play a lot of stock researcher, Paul?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Basically exclusively in blue, white, maybe blue, red rooms. Right. If you have a bunch of rooms as well, but I almost never draft blue, red. Also, notably like this is also just for all of you people who are going to start, you know, we're preparing for a world championship coverage. We also have the arena open coming up for all the best of three draft. This is a totally fine sideboard card to just keep that in mind, even if you're not the blue, white enchantment deck. If you're playing against like a red, white agro deck,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">this is a more than reasonable thing to bring in just to kind of hold the fort while you try to manifest your way into the late game. Totally. It does. It is a very good speed bump. Next is horrid vigor. This is the one in a green instant hard creature to get stuff touching indestructible until in the turn. I don't play this very much, but it does see a lot of play. But I always try to play around it. I'm like, yeah, totally. Yeah. Yeah. That definitely happens.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I wonder if I should play it more. I fear it often enough that it's probably just means that it's powerful enough to put into a deck. It's just, you know, it's a tough sell, right? Because, you know, it is a it can be a somewhat defensive combat trick in the sense that it doesn't increase power, right? Like you're just not like you're kind of hoping to turn it into a removal spell at some point. It does have that upside of double blocks and stuff that can make it actually a good one, but it's not a removal spell. It's much riskier than that.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Yeah. And there's a lot of good instant speed interaction in this format. So you can get blown out if you're the first one that has to flinch and cast this card. Right. You have the dragon fire, you have murder, you have the four mana bounce spell vanish from sight. Like there's just so many different things your opponents can do. But notably, this is super good if you're somehow unlucky enough to draft a survival deck. Right. You get to attack and they have to block your Defiant survivor and then you cast this and then you get your manifest token.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">So I guess there's the place for this. You get to play the bad card in the bad deck. Yeah, it does work. Like it does the things that it says on it, but I just, I don't know. I feel like overall by the end of the format, it'll feel a little bit more like a trap than someplace you really want to be. Next is Rip Chain Razorkin. This is the three and a red, five, three reach and you can pay two and a red and sac a land to draw a card. Just don't put this card in your deck.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I never play this card. Yeah. Do you guys play it? It's just horrible. Like you just get it bounced or killed and you got nothing to show for it and it's not even that good in combat and you never have the time to actually spend mana sac moments. Definitely. I, Paul, what's your opinion on don't make a sound, the mana leak or the mana, the, you know, they have to pay two and if they pay two, you get to surveil too. I haven't played with it too much, but I have played the other one, the, the cancel manifest.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Yeah, cancel manifest I like a little better. Yeah, people took a little exception. Last week I said about don't make a sound. I was like, this card is just terrible. Just don't put it in your deck. I never play it. And people were like, but no, it actually has okay stats. It's like the seventh best common and it's just like, yeah, that's true. But like I knew before asking you that you were going to tell me you had just never played this card. I've considered it, but yeah, it's just not, I just,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I just want my two drops need to be creatures. I don't really care to hold this card up, but the cancel is uniquely very good just because you can manifest if they do nothing. And it's a card that actually, I mean, maybe we can talk about it later, but it is a card that twist reality I think is the name of the card that I tend to play a pretty decent amount, especially in the blue green decks that it even has really good stats too. And people just, you just get this card like last pick. Yeah. It's actually pretty good. It's just like another one of those cards that I just feel you shouldn't put in your deck. Like Marshall, where did you get this package just from the dumpster?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">Like this is literally no playable cards. So far this one is at the bottom of the trash pile. Let's see if we can improve it. Next is winter's intervention. That's the one in a black instant does two damage to a creature and you gain two life. Yeah. Fine garden. I mean it's a good early play, which I like. Yeah. How do you feel about taking a black card early? I don't mind it. I know black's not the best color, but I think it's,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I think it's a reasonable, reasonable thing to do. What about you, Paul? You know, honestly, I can't think of a black common that I would be happy first picking. So yeah, just like blacks commons are just really, really bad. But of course there are a lot of the multicolor cards and one of the best color combinations in the entire format is the reactive sacrifice deck. So I think black is a very, very good support color. You have access to a lot of great removal spells and particularly when you pair it with red. But first picking a black card, I mean, obviously if it's like a great uncommon or a rare, I'll take it,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">but certainly not any of the commons. Living Phone is next. This is the two in a white artifact creature. It's a 2/1 and when it dies, you look at the top five cards of your library and you can reveal a card, a creature card with power two or less and put it into your hand. Yeah. How about just don't put this card in your deck either. Are you off of Living Phone? Okay. Yeah. I actually play it a little bit. Maybe I shouldn't.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I played in red, white. Look, again, the state of magic design and the way cards are made these days, like Living Phone is a fine magic card. Like it's not a terrible card. I just don't think you should put this card in your deck. I don't really see that all the other cards are better basically. Okay. I have it in the same level as, or similar level as the clown that we talked about last pack where it's like it's three mana.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">It's a little worse because clown has like actual dream Living Phone. I feel like doesn't really even have a dream is kind of my problem. I think the clown, I think actually, you know, we talked about sizing earlier and I think for that reason, both the clown and the hardened escort are a good amount better. Just because even if you're on the draw, you can just block whatever manifest or two twos that your opponents can play. So they just fight a little bit better. This thing just loses every single fight and it's just kind of hoping to trade to get a little bit of value. You know,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(62, 62, 62); font-size: 17px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 12px; padding-left: 0px; padding-right: 0px; font-family: 'PingFang SC', Roboto, 'Noto Sans CJK SC', 'Microsoft YaHei', 'Source Han Sans SC', 'Helvetica Neue', Helvetica, Arial, sans-serif;\">I can see a world where if maybe there was a good mid-range controlling deck where you could play this as your three mana card because you're just hoping to trade and get some extra value out of it would be good. But in red, white, you just want your creatures to kind of stick around. So I just like the slightly more robust body on both other three drops in the red, white decks. Okay. Yeah. I mean, I don't know. I feel like the upside is more than a little. I mean, if you hit a card like it replaces itself, but that's pretty dang good. Yeah. There's also just incidentally a decent amount of exile removal spells too.</p>",
                "title": "DSK Paul",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "Luis,youandIhavebeentalking,andwewantedtorevisitithereaswell,aboutwithinaformathowadifferentcardcanh",
                "level": 1,
                "publishTime": "2024/10/23",
                "readingNum": 15,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 14,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "1227036de9d544ae9ebbcc3a9c7808a8"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}