{
    "props": {
        "pageProps": {
            "query": {
                "id": "3bebb3ecbc3d40beaba5c793baa2746c"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82200,
                "outId": "3bebb3ecbc3d40beaba5c793baa2746c",
                "articleOutId": "3bebb3ecbc3d40beaba5c793baa2746c",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">All right, let's chat sealed.<br> The thing about sealed is that some people always you know we got to comment this cycle in the Bloomberg crash course about someone being like,<br> you know,<br> you guys say it's like for pre release but you're only talking about draft like it'd be great if you could like talk about sealed.<br> And I hear that.<br> But like sealed is the same.<br> Like,<br> well except it's significantly worse in every aspect of plague magic.<br> Right.<br> No, I mean it's still this the same.<br> It's largely the same from set to the same card evaluations largely.<br> And it's the same strategy from set to set to set like you're at least for me and maybe there are some sealed wizards out there who are doing it differently.<br> But I think you're looking at you know you're let you want your your bombs to dictate things you're fixing dictates things what colors you're deep in your gold cards like you're it's the same checks and balances you're building you want to build multiple decks if you're playing best of three if you can like you're most aggressive you're most controlling.<br> I'm not doing things different from set to set.<br> Well, and I think certainly for the crash course.<br> We would never have anything more than surface level comments to say about seal like today after playing as much seals you have and I've done,<br> you know, a handful of seals.<br> I feel like we can actually give actionable advice about correct what your pools are likely to look like in this format what you should be steering towards what cards in this specific format actually do definitely get better in sealed by some amount like it would just be impossible to give that kind of deep analysis going into the format.<br> Yeah. So I think it's like you really want your cards to matter at every point in the game.<br> Let your bombs and removal influence your color selection and splash if you're fixing allows that sort of like very very broad strokes of sealed across the board.<br> And then beyond the sort of clear like I think there's going to be whatever let's say 15% 20% on either end of like the top 15 to 20% of pools are just going to be clear like you got a great blue green frogs deck,<br> just build that, and it's easy.<br> The bottom 15 or 20% is like, look, no one's no one can help you.<br> This pool is not particularly salvageable, whatever, just like,<br> this format has some of those like yeah,<br> if you don't get the good comments it is rough.<br> Circa bits was in the qualifier yesterday and he messaged me.<br> He was like, Hey,<br> can you take a look at this pool I've been like usually it takes me like five minutes to build something and I can't quite get there with this and like,<br> so I was like, Yeah, sure.<br> And there were he had so many different options,<br> and each option you got to about 16 cards you were happy with.<br> And I was like, and now what do you do.<br> And so if you have pools like that you're just gonna struggle.<br> So beyond those two things,<br> which like I don't I think the real meat to talk about sealed is whatever that middle 60 70% is because that's where you're going to get your most edge and being able to leverage those pools.<br> I think you really want to try to be green, if at all possible, like,<br> we keep singing greens praises and draft and I think it's the best color and sealed as well and gets even better and sealed because of the thing about you want your cards to just be good at every point in the game and greens rate of its bodies,<br> lets you do that.<br> And you don't really need to work like so much of the other color struggle with some of blues cards care about threshold and rats and some of blues cards are flyers and birds and like greens cards are just good,<br> and like maybe you're going to have some squirrel stuff maybe a lot some raccoon stuff,<br> but greens cards are just good.<br> And it gets three removal spells in long stock brawl Polly wallop and hunters talent one of them is a bomb hunter sound is nuts,<br> and the other two are serviceable Polly wallop,<br> even if you don't have frogs is you're still going to play in your green decks.<br> If that's not enough.<br> You also get fixing and but wait,<br> there's more and fixing is really important and sealed I found like I do think mining,<br> all of the power from your five colors is important and I'm not talking about going full three colors or whatever but a good base two colors and a light splash somewhere a light splash in two spots.<br> If you're fixing allows is important and green giving you keep harvest which is excellent.<br> I might even play three tree root Weaver the one in a green one three manatoric like I don't really like that in draft,<br> but I think in sealed that can be fine,<br> because the one three body is an okay blocker against the people who are trying to do agro stuff,<br> but that's greens fixing and then obviously your colorless fixing in fountain pork bell uncharted Haven and hidden grotto and I guess also patchwork banner but thinking of those three commons are all great cards to open to give you access to playing your best cards.<br> Yeah,<br> green is excellent and it's for all the reasons it's excellent in draft like you are going to get the cross bleed synergy in sealed pools more often than not,<br> you are going to get premium cards and sealed more often than not now,<br> like some sealed pools you open and you're going to have,<br> especially because the play boosters aren't what color collated or whatever you want to call it like you're going to get some sealed pools where you don't have that many green cards and the green cards you do aren't the great green cards.<br> And in that instance, sure,<br> don't be green but I think if we're talking about what the average sealed pool is going to look like the average sealed pool is going to be playing green or should be trying to be playing green.<br> Yeah, that's what I think so.<br> And this has come from some experience of not playing green and then playing against green with non green decks and struggling like but the first pool I think I did was last Sunday Oh yeah I joined a one of those like limited,<br> whatever competitive events that are just like wasn't a super qualifier it's just like like one of those 32 minimum person tournaments on magic online it's just like a six round sealed event with some like top heavy prizes,<br> and I messaged you my deck and I was like,<br> Oh finally got a great blue white deck all it took was sealed,<br> and it was a really good looking blue white deck great curve,<br> good creatures I think I got to play like three rares I had the mockingbird I had the three man a three one flyer that when a flyer you control dies you get to return a creature with lesser mana value from your graveyard to the battlefield like just good cards went clean to oh for oh and my first two matches I was like,<br> Oh, this is sick.<br> I'm a master of field.<br> And then I lost the next four rounds.<br> And I was like,<br> the problem with this deck and I felt this throughout the week when I've built aggressive decks I felt this when I was doing the qualifier for the qualifier last weekend now that was best of one.<br> But like my first pool was a great red white agro deck,<br> one my first two matches easily, and then lost my next two matches easily.<br> And it's because like when green just plays tree guard duo on four and you have if you haven't had your busto busto start,<br> and they're able to just go Baker's bane duo,<br> whatever tree guard duo and you're just like,<br> how is your stuff so big and how am I supposed to get through it,<br> and God forbid they had you know your blue white flyers deck is going to struggle against.<br> And there's a lot of reason there's not a high toughness stuff and like every green deck in sealed,<br> and I think like I'm saying I think most of those middle 60 70% pools should be playing green,<br> you're playing all your sticky tongue sentinels you're playing all of your to for reach squirrels that can forage and draw card you know like,<br> and those cards are putting a hurt on the, the streamlined,<br> the blue white the red white agro decks of the world.<br> Yes, I completely agree with everything you're saying I also messaged you.<br> Yes,<br> the blue white deck that was even better and my deck actually was nuts.<br> It was in five oh I for one.<br> Okay, like horrifically unlucky to not five oh, okay,<br> the deck was truly a dream.<br> Okay, great.<br> Very good so it's possible but I like everything you're saying is 100% right that the average pools should be playing green,<br> and when you're not supposed to play green it will slap you across the face,<br> but I also had one last night I was doing one last sealed run just to try to try to prep a little bit more for the podcast.<br> And I opened my pool, and it was, you know,<br> very obvious that like white and black and green were teeny tiny piles,<br> and my blue and red piles were extended, like okay, I scroll down,<br> I had to scroll down almost and had good blue and red cards had a blue rare had a mockingbird had another red rare maybe was an amber heart challenge I don't remember.<br> And so I was like, Oh, great, I'm supposed to build blue red,<br> and I built blue red and I was like, Oh, really,<br> what are we doing this with my life.<br> And I was like, well, let me just check out like,<br> if I can play green and had like two heaped harvests and a couple three tree reavers.<br> I had a hunter's talent, and it just was enough, like,<br> I could just play salt I because the blue cards I think we'll talk about this in a little bit but I think blue gets quite a bit better and sealed I know I think you get think it gets better but maybe not quite a lot better and I was just able to play base green salt I and I used all of my green cards,<br> like even though the pile was very short and it.<br> After I built it I was like, wow,<br> like I'm pretty sure the pool says I'm supposed to be blue red but just adding green and playing salt I just looks infinitely better because the individual card call is just so much stronger.<br> Yes, and that's so so important like, because again like it comes to.<br> I think you're mostly going to see green and I think green black specifically and whether that ends up being salt I or gender abs and or whatever like if people can splash.<br> I think that's what you're most likely to see is where you're going to get your body's removal and good rates and fixing.<br> And then you're also going to have likely in that you'll have some amount of squirrel food synergies I think that's the easiest inherent synergy to come together and sealed.<br> It puts that that already is putting a pinch on the agro decks now like I said,<br> I've been run over by red white agro by red black agro like it can happen,<br> it's a blue Ben ran people over with his blue white agro deck,<br> it can happen I'm not saying you can't win.<br> And I'm not saying like, you should try like even if your pool is saying,<br> this is the deck that you should try and build something else like the deck I was supposed to play again in the empty geo creator showdown 5k yesterday was red white I mean I sent you my pool I was like,<br> I have some options I had some some Naya stuff I really could have done any combo of the Naya colors I settled on red white,<br> and like it ran some people over.<br> And then it also got brick walled by some tree guard duos and then that's just,<br> that's how things are going to happen sometimes.<br> Yes,<br> I agree that you're hoping to not have to play an aggressive deck and I think this format is slower like I would already say bloom burrow is not a crazy fast format like it's powerful.<br> Yeah,<br> it's powerful when the synergies pop off and it's grinding but the sealed format especially feels slow to me like,<br> like on average,<br> like for example mine spiral the four and a blue sorcery draw three you can give to fish if you do lock a thing down like that card is insane and sealed I think like I cannot imagine cutting copies of it every time my opponents have resolved that I just like all of the air goes out of me and every time I resolve it.<br> I just feel like great, like can't lose from this point it's just such,<br> such a huge boon.<br> Yeah, yeah, it's pretty, pretty good.<br> I haven't really played that much minesboro in sealed this week,<br> now that I'm thinking about it maybe that's some equity I left on the table.<br> I love that garden.<br> Yeah.<br> Um,<br> I will say also that the green beatdown decks can often go over the top of non green agro decks that was one of the things I swapped into and we'll talk about some,<br> some edges in just a second but that's one of the things I swapped into like I had my red white deck.<br> I was facing a green deck like,<br> oh Caleb had this ridiculous red green deck in the showdown.<br> He went red green to drop the mana dork that has expend for get a counter on it.<br> Like that on to turn three played a second one and a cash grab grew them both.<br> Turn four,<br> he played the five mana four five expend for it's a plus two plus one trample did that on back to back turns I was like,<br> what, what is this, what is this nonsense,<br> but to try and I was like well I can never beat this with my red white valiant deck.<br> So I just decided into red green I was like I'll just try and do the thing you're doing and try and go toe to toe with you with some big creatures,<br> and I was able to at least win game two against him,<br> which I definitely would not have been able to do I think if I had my little,<br> little mice running around.<br> So I think just knowing that and that's part of the thing that we're going to talk about here in the last chunk of this episode is playing best of three.<br> I think you just really want to build multiple decks,<br> if you're doing this on arena, you, there's no good way to do this,<br> you have to what I do is I.<br> You export your pool if you don't know how to do this you can just like sort of drag as many cards into your pool to get to 40 decks,<br> and then click like okay I'm done building my deck and then don't enter a match and then above the deck box picture.<br> There's an add to decks button.<br> Add to decks,<br> and then go to your deck lists and export that deck list to seal deck tech.<br> So build your deck in that client,<br> and I will take screenshots of the decks that I am happy with.<br> And so that I have those ready because you only have whatever two and a half minutes for sideboarding.<br> And if you're going to deck swap, it's just you just have to know like,<br> oh,<br> this is what I'm doing and you're just already doing and you want to be thinking about it in game one,<br> like know if you're going to do this in game one so you have all that time and sideboarding and then you get to the decks.<br> In paper sleeve up multiple things whatever like I've done this before and paper sealed tournaments.<br> I'm not saying you always have this option like sometimes you're just going to have your clear best deck and that's it,<br> but a lot of times I think you will want to be thinking about it in the next level.<br> And sometimes it happens it comes up like I,<br> the red green deck I just talked about like I didn't think about that.<br> Prior to the tournament.<br> I wasn't thinking oh this red green deck will be good but as I'm seeing this deck play out against a green deck I need to get my own green beefy bodies as well.<br> And how can I do that.<br> So,<br> you may not have thought about it beforehand but you just constantly have to be thinking about this this like next level war in sealed up my opponents playing this,<br> how can I combat that strategy,<br> because I think oftentimes people aren't thinking that way and so you don't get the like,<br> you know, they're doing the reverse reverse against you,<br> right deal like you're just usually able,<br> they're going to usually stick with what they have,<br> and especially if it's a powerful thing I played against someone with two downwind ambushers.<br> And I was like, Oh,<br> I need to try and cut as many one toughness creatures inside boarding as I possibly can.<br> And there's no way that they're going to be like,<br> well he's probably cutting one toughness creatures so I'll cut my downwind ambushers like,<br> right, that's not happening.<br> Well there's never a leveling war because one of the decks is better.<br> The person with the better deck is just like great I'll crush again.<br> Sign me up.<br> Exactly, right right right.<br> Um,<br> so I think your biggest edge in sealed is going to come from two places.<br> Your niche synergistic card selection like what you choose to put in slots 17 through 23 is I think where you get a big edge and then sideboarding.<br> So, some card selection examples from the week for me.<br> I had a pool with four long stock brawls.<br> The single green fight spell with gift of fish,<br> put a plus one counter on your creature.<br> So I knew I was definitely gonna play green.<br> And I was hoping to play green black I saw that I had two wix patrols the six mana flame tongue kabu's.<br> I had a stargaze that's the X black black draw spell which is also excellent in sealed.<br> But that color pair didn't really give me much on all my creatures were either small or at the top of my curve and so I didn't really have a way to leverage the long stock brawls,<br> but blue gave me three light shell duos,<br> the three in a blue three four prowess ETB surveil two.<br> And a three four prowess is already just like I think that's a will have a list of cards that I think are just better in sealed light shell duo better and sealed because it has we've talked about before,<br> has that body that can tussle with the green creatures.<br> Plus what a combo like I'm never going to draft the deck,<br> probably that has light shell duos and long stock brawls in them.<br> That's fair.<br> But in sealed they were great, like having having that as a package,<br> and then deciding to pair my green with my blue gave me access to a couple of blue white rares on the splash and so that sort of chain reaction happened,<br> and I never thought I would leave two wix patrols and a stargaze in the sideboard of a deck that had black cards to play,<br> but I think that was right.<br> Yeah, and I think just light shell duo in sealed, but I mean,<br> we might as well talk about it now.<br> Yeah, the body the body is incredible.<br> And when you play duo and been to lands or been a land like light shell duo is very close to four minute three four prowess draw card like yeah it's it's rapidly approaching that in sealed.<br> Well,<br> and you're likely to write so much of the stuff in the format is either grindy,<br> or there's,<br> you're either going to have things that care about threshold or things that care about foraging.<br> And so light shell duo not only is giving you card selection off the top of your library but it's giving you synergy.<br> In terms of it, filling your graveyard to some extent.<br> Yeah, it's great.<br> Bumble flower share pot is much better and sealed that's a two minute artifact makes a food and you can pay five tap sack at sorcery speed to blow up and on land permanent.<br> I've had multiple black green decks that really want additional ways to make food right so you have because you're playing all of your forage stuff all of your two fours the draw card and they forward so just having that thing on turn two to make a food and then later on like you get it gets clunky but you get another removal spell colorless removal spell in your deck that can bonus points blow up class enchantments banishing light other opposing patchwork banners whatever like share pot,<br> I'm not saying you know play every single copy you have I've definitely like I'll play one of the three I have etc.<br> But it's a card that again you're really hoping to not play in draft,<br> unless you're like popping off with builders talent,<br> but in sealed I think it gets a lot better.<br> Yeah,<br> just certainly as colors removal but what you're talking about too with bringing the additional food along with it that matters a lot for the black green decks like I was building a black green sealed pool,<br> and what again had food stuff going on but was a little light on food.<br> And I initially in the build had the four in a black instant exile a creature or an enchantment.<br> And then I was like, wait a second,<br> I think share pots just like better in this deck because it gives me a food which was not intuitive for me at all but that that sort of thing can matter.<br> Yeah, yeah, that's great point.<br> Um,<br> you want to talk about card advantage and filtering and I have a little more into chat about stargaze and dire site,<br> but I think you've got a got a thought about a lot of these kinds of cards.<br> Yeah,<br> that's the name of the game to me and sealed like I've already felt just in Bloomberg draft that you're prone to you know mana screw mana flood mana flood,<br> especially if you don't actively include ways to combat it,<br> and I think in sealed it that is ramped up that tension of I mean I really want to draw an appropriate land spell ratio or once I hit my six or seven land drop I want to draw.<br> I want to draw eight lands unless I just have incredible mana sinks.<br> Like I had a deck last night with heat harvests that was really popping off and could use all of them and you know I had eight nine lands,<br> and was happy with that number of lands but I also still had filtering after I hit that point to not,<br> you know, draw my 10th 11th 12 lands which is important to.<br> And decks are generally less synergistic other than you know what we've talked about you're likely to hit salt I synergies,<br> but you're way less likely to hit the other synergies in the format.<br> So,<br> you just play the high quality cards and then you want to find as many of those high quality cards as possible and so you know mind spiral,<br> we talked about already,<br> something like Pearl of wisdom the two in a blue sorcery divination like sign me up that's that those are like reasons to play blue for me I'm probably not splashing.<br> Pearl of wisdom but you better believe I'm splashing mind spiral in my black green decks if I have any sort of fixing that can do it and the other thing that's really impressed me is discard and I want to chat with you about this because you've said that maybe it didn't hit you that way I have been on the end of some absolutely backbreaking psychic worlds the two in a black mind rot variant.<br> Yeah, I haven't,<br> I will confess that is the one of the three I'm in a face bandits hall the chat the class enchantment that I can't believe I ever thought was going to be a good card,<br> and I have faced the ruthless negotiation the single black discard and then it has flashback for in a black and when you flash it back you get to draw a card.<br> I have faced those cards and not been impressed I haven't seen much in the psychic world department so perhaps that's different.<br> Yeah,<br> it's been good enough like I think that's that's the classic thing and sealed right does the mind rot and divination get better.<br> And it has held true for me here.<br> My feeling about the other two so I'll just speak to ruthless negotiation and bandits hall is that that like little pinging of cards doesn't,<br> you're usually able to like if you're the kind of deck,<br> who is playing a ruthless negotiation or a bandits hall,<br> you're not that aggressive right you're doing a sort of attrition war life.<br> And if your opponent is also on the attrition war life.<br> You can usually card out of it like it doesn't really set you back that far.<br> But perhaps psychic world packs, more of a punch.<br> Well like so for example,<br> mine spiral like so many of my matches have keyed around who resolves my spiral,<br> that's so interesting and psychic world like it's hard to not have mine spiral be as the one of your two two cards in your hand and like,<br> so that getting hit by by the discard has been particularly brutal but one of the other things I want to chat with you about is you've talked about your Naya deck right where you main red white in the creator challenge,<br> and you sent me those decks ahead of time,<br> and you you initially said you thought you were going to be a good guy.<br> You initially said you thought you liked green white the best.<br> And I was like,<br> I don't know I kind of like red white because you have these flame clash flame cash geckos which give you filtering.<br> Yeah,<br> like did it did those pan out to be as good as I thought they would be in that deck.<br> Did you find yourself rummaging with them?<br> Not really, not really interesting.<br> I just didn't find like,<br> but I think part of it is that like when you're if you're at a point with your red white agro deck,<br> where you're rummaging, you've lost the game,<br> because you're not even gonna like you're getting card filtering,<br> but you're getting card filtering at the cost of mana.<br> And by that point your geckos probably blanked like I didn't find like,<br> I think that's a fair assessment of the deck,<br> but I didn't find that it played out that way.<br> Like I've played against that card once and sealed and it felt like I had to kill it over the course of the game where I was going to lose eventually to the filtering that it provided.<br> Interesting, but in an in an aggressive deck from your opponent?<br> No, I played against almost no aggressive decks in sealed.<br> They're because they're not great.<br> They're not great.<br> Another thing that I've had come up just coming back to card selection examples and this really goes to sideboarding.<br> So we can dovetail us into sideboarding after we talk about cards but I saw an opponent who had two long stock brawls.<br> Well,<br> what's a great way to combat long stock brawls is high stride the single green plus one plus three untapped trick like that's the kind of thing like,<br> especially once you see like two copies of something,<br> something you know your opponent's going to be playing like how you choose to engage with that doesn't have to be a full on deck swap,<br> but you want to be thinking about okay, I'm seeing the downwind ambushers.<br> Can I get rid of my x ones to mitigate that card?<br> Can I have seen too long stock brawls?<br> Can I bring in the high strides thinking about that is I think where your edge is going to come.<br> Yes.<br> How do my cards line up better against my opponents and and especially if your deck is worse,<br> right?<br> Like how can I like what has to happen for me to win and my opponent going for long stock brawl and me having the high stride like getting putting yourself in a position to get lucky in situations where you know your cards line up well against your opponents.<br> Yeah. So deck swaps are the most obvious ways to sideboard right your opponent is a more controlling deck a better controlling deck than you.<br> So you swap into your agro deck to try and go under them.<br> I talk about this a lot but I think play draw really dictates that for me.<br> If I'm, if I'm on the play.<br> I'm more likely to want to side into my agro deck,<br> because I know I'm going to get to have the jump there.<br> I'm not going to sign into my agro deck on the draw ever.<br> That's not going to be a good thing.<br> There might also be a thing where you think, hey,<br> we've got both got good late game decks,<br> I think my late game deck is better.<br> I'm putting you on the play.<br> I want that extra card.<br> I'm never doing that in the dark.<br> I don't think.<br> I mean,<br> you might do it so so rarely if you were had a million two mana removal spells whatever but like having that information up with my opponent on the play for sure.<br> Beyond the big those big swaps.<br> I think,<br> thinking about key cards you've seen from your opponent we've talked about like obviously bring in you bring an artifact enchantment hate as silver bullets for important cards.<br> Do they have incidental graveyard hate.<br> That's like the the green green rare that can munch graveyards and grow to a 77.<br> Like if you've seen that and you're relying heavily on threshold or forage stuff like,<br> is there a way you can lean away from that,<br> just to again to mitigate the impact of that card because it's already going to be impactful against you.<br> Even without lizards,<br> I've brought in scales of shale we've talked about just playing it in any black deck,<br> but against some specific decks like red green,<br> that's going to be trying to tussle with long stock brawls and Polly wallops and hunter's talent and using combat tricks like getting scales of shale to just eat their big green monster and gain some life is going to be good.<br> I have done stuff where, are you playing against a heavy removal deck.<br> Well,<br> try and overload them with derpy threats like just try and curve out on them with two mana two two three mana three three four mana four four and put a pinch on their noxious hungers or whatever,<br> you know, like, I think that those kinds of,<br> I mean leveling war isn't the right way to think about it but that's the kind of way that I think you're going to get your edge and sealed is when you think about,<br> okay, that's what they're doing.<br> What's, what's the rock to that scissors.<br> Yes. Mm hmm.<br> Rock paper scissors that's that's that's the right way to think about it.<br> Yeah. And I think one other thing we should state if we haven't done it clearly is where you want to look first when you open your shield pools right so when I when I open a seal pool like I'm looking at green first.<br> And then after that I'm looking at colorless fixing like I want to see how many uncharted havens I have I want to see how many of the little bell what's that card down port Bell port bell yeah I want to see how many of those I have because that card does get a lot more playable and sealed,<br> and specifically in green also.<br> I don't know that we've saying heaps harvest praises,<br> and let's start is incredible in seal like two copies of that lets you do whatever you want with your seal pool that's that's like a really good card to open assuming you have any other green support alongside it because it just has two basics.<br> It's,<br> it's so much card advantage and you want the mana in sealed keep harvest is an absolute gem.<br> So I think you're looking at green you're looking at colors fixing,<br> and then pass that the first thing I'm looking for is obvious to color builds,<br> like, checking that out.<br> And then the next thing I'm building if there are no obvious to color builds is green black or green blue or salt I something in there.<br> And then if that's not working, then,<br> then you're just probably have a pretty unique will probably dropping.<br> Um,<br> let's chat about some specific cards that I think get better and sealed and we've touched on some of these already light shell duo.<br> We love thorn plate Intimidator again and these,<br> these are cards that are just a lot of these cards for me are like their filler plus,<br> and their card like it's not like, oh,<br> you're never cutting this from any deck but it's a card that like the word played Intimidator I'm probably hoping to like just never play in draft and in sealed I think it's serviceable so this is the three in a black for three as the punisher text right when it enters the battlefield,<br> your opponent has to either discard a card second online permanent or lose three life and it has offspring three.<br> This tussles with green and and does something.<br> In addition,<br> when it comes into play and has the option offspring as sort of a late game menacing similarly bone bind order,<br> the one in a black to to pay three in a black to exile it from your yard to return something curve filler,<br> and you're playing your best cards so this says, oh,<br> you killed my Maha cool it's coming back right like this card is, you're,<br> you're definitely playing at least the first copy I think in any black sealed deck.<br> Yeah, I don't think it should be,<br> and like what you said just to be clear this isn't pulling you towards black.<br> No, no, no,<br> how did that it's kind of possible to leave your opponents bone by an orders on the battlefield if you want to like I've played those kinds of games were like what you have one threes and you're like deal with it.<br> Yeah,<br> and like when you decide to be offensive like you need to be offensive quickly so that your opponent doesn't have the time to leverage like I've definitely played some bone by an order dances in the sealed format.<br> That's fair.<br> And I know I've been saying that I don't think agro is great and sealed,<br> but the times when agro has been great against me.<br> It's often involving Kindle spark duo, which is one three that pings.<br> It's like, you're not like you're at six and they're just like,<br> do you have a removal spell for my garbage one three.<br> And the answer is no, the answer is no you're just dead.<br> That's a hard sell for me the body on Kindle spark duo is real bad,<br> it's bad.<br> All I'm saying is it like if you feel like you have to be aggressive in your pool.<br> It providing reaches and I think like it's a card that I would often overlook but I've died to it enough this week and sealed that you have respect for that I'm respect I respect for it as a like,<br> okay, if that's where my pool is leading me.<br> I want to keep an eye out for that card and perhaps even ways to maximize it like someone,<br> I saw some pool where someone had the, you know,<br> if you have the two in a red,<br> three three rare that makes all of your red creature type stealing additional damage.<br> Get those Kindle spark duo's in there baby.<br> Yeah, yeah.<br> And similarly,<br> another derpy three man on one three and strike force the one three flying vigilance double strike another card that's just like,<br> I'm not crazy about it and draft like it's fine but it's Oh really I just think it's a good card.<br> It's a, it's a good it's good good.<br> I don't know, I like it doesn't do anything I don't care about its types.<br> I got better stuff to do for three mana,<br> but in sealed this card is a problem this card is just is really good and sealed I think this card is a problem everywhere there were some aggressive air quotes for those of you who are not watching on YouTube.<br> When the word was thrown around on our course strike force is a powerful magic the gathering card.<br> You're not, I want to know where this falls in your pick order it's like,<br> I don't know rank all the cards in the format this is like number 80.<br> Like you're not like you're not taking this highly at all.<br> Well, I agree with this next card on your list to Warren elder.<br> Yeah,<br> Warren elders is similar to bone by an order like you have to play twos.<br> And this just is way better and sealed and is in draft because the games are so much more likely to stall out.<br> So it's got the activated ability three and white give your team plus one plus one and threat of activation on that's really can enable attacks without you having to spend the mana.<br> A very good card and sealed much better than it is in draft.<br> And then just a slew of card advantage cards we've talked about mine spiral pearl of wisdom psychic world like divinations and mine rots getting better.<br> Alani has pathmaker Hello,<br> way better and seal the three and a red for two lets you exile the top card your library and play until the end of your next turn that that's the type of card you want and sealed is just reasonable body plus card advantage.<br> This is also the second like medium draft card on this list.<br> The in thorn played intimidating now Alani is pathmaker it's for power not in green it's a four mana for power thing not in green,<br> which lets you tussle with greens for mana three fours and four fours,<br> it's so important.<br> Super important Zaza caps brews another one this just falls in the card advantage card filtering like you just want to make sure that you draw the right ratio of lands and spells.<br> And this is a tormenting voice is is worth,<br> including if you're playing red,<br> I might go so far if I had good fixing as to splash Alani as pathmaker if I needed bodies or wanted wanted card advantage but Zaza caps brew is not not on that life.<br> Yeah. bandits talent is another one.<br> You've said you've not like this card.<br> I'm not buying what you're selling here on bandits talent.<br> Well, but it's it's the bandits talents,<br> plus the psychic world's like you can you can really pinch your opponent's hand,<br> my brother have you tried affecting the board in limited in 2024.<br> I mean, but sealed hasn't been that for me I don't know,<br> I have literally played against you and your opponents are just like I attack your hand well I add cards to my hand,<br> your hand like a lot of high toughness creatures.<br> A lot of battles for card advantage.<br> Okay. It's been been salt I salt card advantage wars.<br> So I don't know I have been impressed with bandits on psychic world,<br> but maybe I'm leading the listeners astray,<br> maybe the green decks just hit too hard.<br> About the second line of text on the first class level on bandits now I just like had shortcut it in my mind to be just discard a card,<br> but it's either discard.<br> Basically two lands or a non land card,<br> because I went to try and just discard a land on arena.<br> You either pick your two lands or pick the spell was like, oh okay,<br> it's a little bit more annoying.<br> Oh, also speaking of resolving things.<br> I don't know if I just haven't cast mind spiral on arena yet I probably haven't would be my guess.<br> But on empty Joe you have to target the player that draws two cards and my instinct is always to target who I'm gifting first first time I guess it.<br> I gave my opponent three cards, three cards because I was like,<br> I got to the third step where you choose the gifted person and I was like this is really weird I already did this and click your land and I was like,<br> Oh,<br> I had a similar thing on arena yesterday the white white uncommon that either exiles a thing,<br> and then comes back with a counter or you exile and you give them a fish.<br> My opponent was trying to skyscraper duo, a creature,<br> they're trying to blink a creature I was like, Oh,<br> I'm going to exile it and respond so they don't get the re ETB and arena was like,<br> Are you sure and I was like, Yeah, I'm sure.<br> Get that thing dead and then it came back and turn with a plus one plus one counter on it.<br> Rip.<br> Pour one out.<br> Stargaze we've alluded to Stargaze is incredible.<br> I can't imagine ever not including it and it is a reason to play black Stargaze is a house and sealed blacksmith talents another one I've played with blacksmith talent a ton more this weekend knew it was good but I hadn't come from playing against it but I have like with it.<br> I played with it in draft and in sealed.<br> It's just incredible and sealed just making every creature into an insane threat is very taxing on your opponent's removal.<br> Yeah, I agree.<br> And lastly,<br> flame cash get go I think as much rummaging and filtering as I can get sign me up.<br> Attack your hand add to your hand profit when it's right.<br> So do you think you're going to do best of three next weekend on Saturday.<br> Have I can I commit No, there's no way you're sick.<br> You just love pain and punishment and you're going to play best of one.<br> Well, yeah, I don't know,<br> maybe I'll maybe I'll do best of three just despite you to prove you're wrong.<br> That'll really show me.<br> Like I did three best of three runs and I didn't qualify Ethan you happy.<br> I can't wait for that message.<br> Yeah, I'm sure it'll be coming.<br> That'll be great.<br> Anything else before we go here.<br> No, that's I think that's a great,<br> great place to and it's appropriate phrase for sealed to wrap us up.<br> Wrap us up.<br> Yeah. And good luck to everyone competing in the arena open this weekend.<br> Yeah. All right.<br> Thank you as always.<br> Salty pretzels for intro and outro music.<br> Make sure you give it a listen.<br> You can find all of our content at Lords of limited.com there's links to our tier list courtesy of Ben and 17 lands links to our episode backlog our YouTube channel our respective twitch streams.<br> Our merch courtesy of T public as I sip my coffee out of my Lords of limited mug.<br> All that stuff is available at Lords of limited.com.<br> If you've got any feedback about the show or any questions,<br> shoot us an email at Lords of limited at gmail.com.<br> Thanks so much for listening and we'll catch you next week for another episode of Lords of limited.<br> Thanks, everybody.<br> See you later.<br> Later.</p>",
                "title": "BLB Sealed",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "Allright,let'schatsealed.Thethingaboutsealedisthatsomepeoplealwaysyouknowwegottocommentthiscycleinth",
                "level": 1,
                "publishTime": "2024/08/19",
                "readingNum": 7,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 9,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "3bebb3ecbc3d40beaba5c793baa2746c"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}