{
    "props": {
        "pageProps": {
            "query": {
                "id": "3e4a0810cfd7477cb68760a5f1161dfe"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82509,
                "outId": "3e4a0810cfd7477cb68760a5f1161dfe",
                "articleOutId": "3e4a0810cfd7477cb68760a5f1161dfe",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">poor segue, sorry, and talk about the other big set of cards that it plays well with that you might want to use Bell to splash for, which is other talents. All of the talents are non-land, non-creature permanents, so they all give you one trigger off builder's talent straight up. Some of them play significantly better with builder's talent. So, for example, Blacksmith's Talent gives you two objects right away, one for the talent and one for the sword that it makes, so you're getting just like two +1/+1 counters right off the bat for one mana. Caretaker's Talent wants you to have a token,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">which builder's talent creates, and then you can use the caretaker's talent to copy the 0/4 to get another 0/4, which is probably usually better than the 1/1 you're generally planning to get off caretaker's talent, and then draw a card. Now you have like this defensive setup and long game engine with your card draw from caretaker's talent and extra counters from builder's talent, so those play really well together and they're in the same colors. And then Innkeeper's Talent, like, okay, if you have Innkeeper's Talent, you don't really need much else going on, but it's kind of cute that you get to level it up all the way and then double your counters from your builder's talent. And Scavenger's Talent, the one mana black rare talent,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and its first ability before you level it up at all is that when one of your creatures dies, you make a food only once per turn, so that means that any time if you have both of these talents and one of your creatures die, you get a food, which triggers the builder's talent, which gives you a +1/+1 counter. So Scavenger's Talent is in the long run probably going to net you more counters than almost any other single card in the set. So maybe even just the single most. So really good with talents in general and those talents in particular. So I want to take a moment to look at what the decks that pair these talents with builder's talent might look like. Some of them are more obvious than others, right?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">So like caretaker's talent plus builder's talent, okay, we have two good white cards that want like tokens, they both really want carrot cake, they both are pretty happy to play a long game. Maybe your like green white axe, just kind of a generic rabbit thing with like offspring, maybe some food cards, head of the homestead. You could be aggressive, but you also use Honored Heirloom, the one mana artifact lets you tap four mana and/or creatures to draw a card at sorcery speed. You can play that really well,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">which means that you're pretty well positioned to grind with the card advantage from the heirloom and the caretaker's talent, the extra counters from the builder's talent, just a bunch of creatures to block with, your counters make them bigger so it gets really hard to attack into. Blacksmith's talent, this one's like a bit weird because blacksmith's talent is usually best in aggressive decks. This is the one that makes the sword and then you can level it up to equip stuff for free and then you can level it up again to give double strike and haste. So it's a bit of a weird pairing, like you have an aggressive talent and a defensive talent, but blacksmith's talent does want a lot of mana invested in it and does give you a really overwhelming late game where you just throw your very strong,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">your well-buffed creatures at your opponent one at a time and make them deal with it. So I could actually imagine building a red-white or red-white-X control deck around both of these talents using valiant creatures because both builders and blacksmith's talent are good at targeting creatures. And some of the valiant creatures like whiskersquill scribe the card that loots when you target it, as well as a few of the ones that get +1/+1 counters when you target them, the red-white hybrid common scribes when you target it, so you're getting card selection and kind of growing over time. And so the valiant payoff stuff doesn't have to be directed entirely toward killing your opponent as fast as possible, you can just kind of be accruing value and bigger stuff in card selection using red-white removal and trying to play a long game where you're actually grinding out extra value with the valiant stuff, which I haven't really noticed an opponent trying to do, but I think that there's something there,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">particularly if you have these talents to support the backbone of the long game with the deck. Scavengers talent, obviously you want to be a very... you want everything you can that's making extra objects and you want to be playing a long game, and typical scavengers talent stuff but that kind of abs-and-food space is going to play really well with both of them. So instants that make food are another really good thing to look for. That would be Savor, Cash Grab, and Pawpatch Formation. Savor is the -2/-2 instant that makes a food, Cash Grab is the mill for \"put a permanent formamant into your hand\" and if you have a squirrel or take a squirrel, get a food, and Pawpatch Formation is the modal spell where one of the modes is \"draw a card,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">make a food.\" So with Builder's Talent, all of those become combat tricks, so it gives you appreciable extra value on these cards that are pretty good otherwise, and Cash Grab obviously has a little bit of extra synergy because if you see and don't take a non-creature permanent from among those cards, you can always get it later with the Builder's Talent. Of course, Share Pot is great with Builder's Talent, it's two objects up front and a removal spell that you can get back for two more triggers later. It's a lot of mana, so your deck needs to be in this waiting around and spending a lot of mana, but as I'm saying,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">that's basically where you want to be with all the Builder's Talent decks. Fountainport, the Rare Land, is another really big one to look for with Builder's Talent. Really low opportunity cost to put it into whatever deck you have, and it's just generally really good when you're playing long games. Also, you're playing Builder's Talent, so you're probably making a bunch of food, so Fountainport will let you sacrifice the food to draw cards. And most importantly, when you spend four mana and tap Fountainport to make a treasure,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Builder's Talent will trigger and you'll get a +1/+1 counter, so that means that your Fountainport can be an onboard combat trick that is pretty easily overlooked, incidentally, so you'll get some amount of value out of opponents just not playing around with that, speaking from experience there. And yeah, Honored Heirloom is very good with Builder's Talent, again, mostly because they're both looking for playing long games and they both really appreciate Carrot Cake. You're probably going to be into making little tokens when you have Builder's Talent because you're playing white and you want to reliably have bodies to put the counters on, and it doesn't necessarily matter if the body is big to start because you can make it big with the Builder's Talent. So then if you have a bunch of bodies and you're playing a long game,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">the Heirloom will draw cards over time to find more non-creature permanents to give you more triggers. Oh, Heirloom Epic, not another Heirloom, sorry, my mistake, yes, Heirloom Epic is the card that I'm talking about. And yeah, that's in a very similar space to Stalking the Pantry. A little bit less efficient in terms of mana on drawing the card, but also requires a little bit less synergy. Like, with Stalking the Pantry, if you don't have other +1/+1 counter sources aside from Builder's Talent, the Stalking the Pantry won't do anything some portion of the time, whereas the Heirloom Epic is going to be more reliable on its own.</p>",
                "title": "builder2",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "poorsegue,sorry,andtalkabouttheotherbigsetofcardsthatitplayswellwiththatyoumightwanttouseBelltosplas",
                "level": 1,
                "publishTime": "2024/08/24",
                "readingNum": 2,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "3e4a0810cfd7477cb68760a5f1161dfe"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}