{
    "props": {
        "pageProps": {
            "query": {
                "id": "63886944e0904c1da4eee052aaf0166b"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82216,
                "outId": "63886944e0904c1da4eee052aaf0166b",
                "articleOutId": "63886944e0904c1da4eee052aaf0166b",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">ones to mitigate that card?<br> Can I have seen too long stock brawls?<br> Can I bring in the high strides thinking about that is I think where your edge is going to come.<br> Yes.<br> How do my cards line up better against my opponents and and especially if your deck is worse,<br> right?<br> Like how can I like what has to happen for me to win and my opponent going for long stock brawl and me having the high stride like getting putting yourself in a position to get lucky in situations where you know your cards line up well against your opponents.<br> Yeah. So deck swaps are the most obvious ways to sideboard right your opponent is a more controlling deck a better controlling deck than you.<br> So you swap into your agro deck to try and go under them.<br> I talk about this a lot but I think play draw really dictates that for me.<br> If I'm, if I'm on the play.<br> I'm more likely to want to side into my agro deck,<br> because I know I'm going to get to have the jump there.<br> I'm not going to sign into my agro deck on the draw ever.<br> That's not going to be a good thing.<br> There might also be a thing where you think, hey,<br> we've got both got good late game decks,<br> I think my late game deck is better.<br> I'm putting you on the play.<br> I want that extra card.<br> I'm never doing that in the dark.<br> I don't think.<br> I mean,<br> you might do it so so rarely if you were had a million two mana removal spells whatever but like having that information up with my opponent on the play for sure.<br> Beyond the big those big swaps.<br> I think,<br> thinking about key cards you've seen from your opponent we've talked about like obviously bring in you bring an artifact enchantment hate as silver bullets for important cards.<br> Do they have incidental graveyard hate.<br> That's like the the green green rare that can munch graveyards and grow to a 77.<br> Like if you've seen that and you're relying heavily on threshold or forage stuff like,<br> is there a way you can lean away from that,<br> just to again to mitigate the impact of that card because it's already going to be impactful against you.<br> Even without lizards,<br> I've brought in scales of shale we've talked about just playing it in any black deck,<br> but against some specific decks like red green,<br> that's going to be trying to tussle with long stock brawls and Polly wallops and hunter's talent and using combat tricks like getting scales of shale to just eat their big green monster and gain some life is going to be good.<br> I have done stuff where, are you playing against a heavy removal deck.<br> Well,<br> try and overload them with derpy threats like just try and curve out on them with two mana two two three mana three three four mana four four and put a pinch on their noxious hungers or whatever,<br> you know, like, I think that those kinds of,<br> I mean leveling war isn't the right way to think about it but that's the kind of way that I think you're going to get your edge and sealed is when you think about,<br> okay, that's what they're doing.<br> What's, what's the rock to that scissors.<br> Yes. Mm hmm.<br> Rock paper scissors that's that's that's the right way to think about it.<br> Yeah. And I think one other thing we should state if we haven't done it clearly is where you want to look first when you open your shield pools right so when I when I open a seal pool like I'm looking at green first.<br> And then after that I'm looking at colorless fixing like I want to see how many uncharted havens I have I want to see how many of the little bell what's that card down port Bell port bell yeah I want to see how many of those I have because that card does get a lot more playable and sealed,<br> and specifically in green also.<br> I don't know that we've saying heaps harvest praises,<br> and let's start is incredible in seal like two copies of that lets you do whatever you want with your seal pool that's that's like a really good card to open assuming you have any other green support alongside it because it just has two basics.<br> It's,<br> it's so much card advantage and you want the mana in sealed keep harvest is an absolute gem.<br> So I think you're looking at green you're looking at colors fixing,<br> and then pass that the first thing I'm looking for is obvious to color builds,<br> like, checking that out.<br> And then the next thing I'm building if there are no obvious to color builds is green black or green blue or salt I something in there.<br> And then if that's not working, then,<br> then you're just probably have a pretty unique will probably dropping.<br> Um,<br> let's chat about some specific cards that I think get better and sealed and we've touched on some of these already light shell duo.<br> We love thorn plate Intimidator again and these,<br> these are cards that are just a lot of these cards for me are like their filler plus,<br> and their card like it's not like, oh,<br> you're never cutting this from any deck but it's a card that like the word played Intimidator I'm probably hoping to like just never play in draft and in sealed I think it's serviceable so this is the three in a black for three as the punisher text right when it enters the battlefield,<br> your opponent has to either discard a card second online permanent or lose three life and it has offspring three.<br> This tussles with green and and does something.<br> In addition,<br> when it comes into play and has the option offspring as sort of a late game menacing similarly bone bind order,<br> the one in a black to to pay three in a black to exile it from your yard to return something curve filler,<br> and you're playing your best cards so this says, oh,<br> you killed my Maha cool it's coming back right like this card is, you're,<br> you're definitely playing at least the first copy I think in any black sealed deck.<br> Yeah, I don't think it should be,<br> and like what you said just to be clear this isn't pulling you towards black.<br> No, no, no,<br> how did that it's kind of possible to leave your opponents bone by an orders on the battlefield if you want to like I've played those kinds of games were like what you have one threes and you're like deal with it.<br> Yeah,<br> and like when you decide to be offensive like you need to be offensive quickly so that your opponent doesn't have the time to leverage like I've definitely played some bone by an order dances in the sealed format.<br> That's fair.<br> And I know I've been saying that I don't think agro is great and sealed,<br> but the times when agro has been great against me.<br> It's often involving Kindle spark duo, which is one three that pings.<br> It's like, you're not like you're at six and they're just like,<br> do you have a removal spell for my garbage one three.<br> And the answer is no, the answer is no you're just dead.<br> That's a hard sell for me the body on Kindle spark duo is real bad,<br> it's bad.<br> All I'm saying is it like if you feel like you have to be aggressive in your pool.<br> It providing reaches and I think like it's a card that I would often overlook but I've died to it enough this week and sealed that you have respect for that I'm respect I respect for it as a like,<br> okay, if that's where my pool is leading me.<br> I want to keep an eye out for that card and perhaps even ways to maximize it like someone,<br> I saw some pool where someone had the, you know,<br> if you have the two in a red,<br> three three rare that makes all of your red creature type stealing additional damage.<br> Get those Kindle spark duo's in there baby.<br> Yeah, yeah.<br> And similarly,<br> another derpy three man on one three and strike force the one three flying vigilance double strike another card that's just like,<br> I'm not crazy about it and draft like it's fine but it's Oh really I just think it's a good card.<br> It's a, it's a good it's good good.<br> I don't know, I like it doesn't do anything I don't care about its types.<br> I got better stuff to do for three mana,<br> but in sealed this card is a problem this card is just is really good and sealed I think this card is a problem everywhere there were some aggressive air quotes for those of you who are not watching on YouTube.<br> When the word was thrown around on our course strike force is a powerful magic the gathering card.<br> You're not, I want to know where this falls in your pick order it's like,<br> I don't know rank all the cards in the format this is like number 80.<br> Like you're not like you're not taking this highly at all.<br> Well, I agree with this next card on your list to Warren elder.<br> Yeah,<br> Warren elders is similar to bone by an order like you have to play twos.<br> And this just is way better and sealed and is in draft because the games</p>",
                "title": "BLB Sealed 4",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "onestomitigatethatcard?CanIhaveseentoolongstockbrawls?CanIbringinthehighstridesthinkingaboutthatisIt",
                "level": 1,
                "publishTime": "2024/08/19",
                "readingNum": 7,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 9,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "63886944e0904c1da4eee052aaf0166b"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}