{
    "props": {
        "pageProps": {
            "query": {
                "id": "6a422687fc8b49a0ab463472dd18dfe6"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 86050,
                "outId": "6a422687fc8b49a0ab463472dd18dfe6",
                "articleOutId": "6a422687fc8b49a0ab463472dd18dfe6",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">In this MTG Foundations draft guide, I will be covering everything you need to know before diving into the format. I will be discussing the top commons for each color, archetype overviews, combat tricks to be aware of, traps to avoid, combos you can assemble, and more. Kicking things off with the top commons, starting with white, at number one is Helpful Hunter. Two mana for a 1/1 is not the greatest stats, but it has those magical words \"Draw a card,\" which means it is just excellent.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">If you ever trade this for one of your opponent's cards, you've gotten a huge advantage because your card replaced itself. It smooths your draws, helps you find your good cards, helps you hit land drops, and has great synergy with other cards in the format. As a result, it's going to be a 2-drop that is highly prized. At number two is Beldar Savior. This is a really nice curve topper for your aggressive decks, because the fact that you're able to put counters on creatures you already have in play will enable attacks and let you continue pressuring your opponents. The fact that you have a 4-mana 2/3 lifelinker left behind is also really nice for this card,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and it's going to slot into a lot of the best white decks. Now, if you don't have a ton of creatures in your deck, it is going to be weaker because you won't be able to benefit from the counters ability, so keep that in mind when drafting this card. But if you're able to play this on turn four while curving out, it is absolutely backbreaking, and so it is worth prioritizing. At number three is Banishing Light. Really good removal spell, Flexible, can answer anything you care about from your opponent's side of the board. Being 3-mana and sorcery speed is totally reasonable considering the flexibility of this card,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">though you do need to be a little bit careful if your opponent has some removal for enchantments. Moving on to blue and kicking things off at number one with Bigfin Bouncer. 4-mana for a 3/2 is not the greatest stats, but the fact that this comes with such a tempo swing by being able to bounce one of your opponent's creatures is absolutely great. This card is going to be really good when you're curving out and trying to pressure your opponents because you're going to be able to set them behind and make it hard for them to block. But it's also going to be good when you're trying to bounce back from a quick start on the opponent's side of the board because you can reset their bigger attackers and have a blocker to boot. So Bigfin Bouncer is a really good card. At number two is Uncharted Voyage. This is just the sort of removal spell that blue gains access to. It does provide you a little bit of card filtering and can deal with problematic cards from your opponent.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">For 4-mana and instant speed, it's not crazy good, but it's definitely solid and worth picking if you need some interaction in your blue decks. And then at number three is Tolarian Terror, which is not the greatest card in every blue deck, but in the blue decks where it's good, it is absolutely fantastic. If your deck has lots of instants and sorceries or has ways to fill the graveyard, then being able to play Tolarian Terror for cheap is really, really powerful in the mid-game and really can help you turn the corner and swing games in your favor. There are some blue decks that don't want it, but it is definitely worth speculating on early if your deck could potentially lean in that direction.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next is Black, and at number one is Bake Into a Pie. 4-mana to destroy a creature at instant speed is great, and the fact that it comes with a food should not be underestimated. The fact that you can gain some life to help you stabilize is really nice. There are some life gain synergies in this format, which is also good, and just having a food token is going to change the way you're able to play the game because of that life gain. So, Bake Into a Pie is a nice number one option. At number two is Stab. This is really nice as cheap interaction to slow down your opponents while they're curving out. It's not going to be able to kill all of their cards,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but it is going to be able to kill their early cards for just one mana. So if you can kill a 2-drop with this for just one mana, you're able to pull ahead on mana and get a nice advantage because of it. So Stab is a really nice card and can also be used as a combat trick of sorts. If you are in combat where 2-3-3s are fighting each other, you can shrink your opponent's creature and kill a bigger creature with Stab as a result. So it's a nice card. And then at number three is Eaten Alive. You'll notice three removal spells for black, which does mean that you maybe don't need to take a removal spell every time you see one.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">These cards are really good. Eaten Alive is great. The fact that you can pay five mana to exile any creature you care about is nice, and sometimes you'll have something to sacrifice that you don't care about dying or that you actively want to die. There are some cards in this set that care about having creatures die, and so Eaten Alive can help you trigger those even if you aren't able to necessarily have creatures trade in combat or things like that. So this is a really nice suite of removal spells for black. Next up is Red. At number one is Burst Lightning, another really nice removal spell for cheap that also scales into the late game because if you pay the kicker cost,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">you're able to kill things that are more medium-sized or larger as well. And it's also worth noting that this can go straight towards your opponent, and so if they do get low, you can burn them out with some Burst Lightning, which is really, really nice and good upside to have on a removal spell. So Burst Lightning comes in at number one. At number two is Courageous Goblin. This is just a typical two drop that scales pretty well into the game. As a two mana two-two, it can trade off with your opponent's two drop, and then if you're able to enable this fairly early in the game to attack as a three-two menace,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">it really does become problematic for your opponents. This card won't fit into decks as highly if you aren't trying to attack and playing big creatures, but a lot of red decks are going to be interested in that sort of thing, and so Courageous Goblin definitely gets a nod on that front. And then at number three is Gorehorn Raider. This is just a really nice payoff for being an aggressive red deck. You get to attack your opponent with your creatures and then play the Gorehorn Raider post-combat and then either kill one of their small creatures or finish off one of their bigger creatures that they use to block. So all of a sudden, a four-four creature from your opponent can't hold back all of your two-two attackers because you're going to be able to finish it off with your Gorehorn Raider. Or if you have a free attack,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">let's say you have a flyer or something of that nature, Gorehorn Raider can then be used after you attack with your evasive creature and snipe something. It's also worth noting you can target your opponent. So once again, a little bit of extra reach for red, making this a nice card for your decks. Next up is green. At number one is Bite Down. Really nice removal spell for green to have access to. Instant speed makes it a lot harder for you to get blown out going for this sort of effect. And overall,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">it's the best interaction green gets and is worth prioritizing as a result. At number two is Llanowar Elves. This card is really good at leading to really accelerated draws. So you play this on turn one, all of a sudden you can play two drops, I mean three drops on turn two, which is very powerful and just changes the way the game plays out completely. It is a bit of a liability to top deck in the late game, but that early game upside is definitely making this card worth taking early. And at number three is Apothecary Stomper. This card is just a nice top end card for green.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">If you need life gain, the four life can definitely be worth it. And the two counters are going to be the default mode. Oftentimes you can put the counters onto the stomper to have a truly large threat. But if you think your opponent has removal spells, the ability to put the two counters onto a different creature you control is also really nice. It can also enable attacks. So maybe you're trying to attack your opponent down and you can play the Apothecary Stomper at the top end, buff one of your creatures and immediately enable attack, which is also nice. And vigilance is a pretty good ability for your big creatures to have because it lets them play offense and defense.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next up is the color rankings. It's worth noting, of course, that it's better to draft the open color than it is to force a color just because it's higher in the rankings. So use this more of a tiebreaker. At number one is white. White has great removal, great creatures, good aggressive options and also really good just cards in general. So high card quality and a deep card pool brings that to number one. And number two is green. It also has a really deep card pool of just solid cards.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">There's nothing really terrible in there. And anything you play in green pretty much is going to be nice and does have some really nice cards as well. Red has some great removal spells, some great aggressive options and also pairs well with the other colors. So it comes in at number three. Black has that great removal that we highlighted, but does have a little bit weaker of card quality, especially like uncommon where it does have some kind of dud uncommons especially. And then blue has a little bit lower card quality, has some dud uncommons, definitely a color that you can draft and does have some nice color pairings,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but does come in a little bit weaker than the other options. Though, of course, as I already said, use this as more of a tiebreaker than a go into the draft trying to draft certain colors type approach. Next up are the archetype overviews. First up is red white, which is an aggressive deck that can also have some go wide elements. Heroic reinforcement is a really good card as a curve topper. So if you go two drop, three drop heroic reinforcements, you're going to win a lot of those games. And it's also a really good top deck in the mid game where you can just buff up your entire team and hit your opponent for tons of damage.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Goblin negotiation is also a really nice card in this sort of deck, especially if you have something like heroic reinforcements, because in the mid to late game, you can put a ton of mana into this card, kill your opponent's threat and also make some extra creatures. And that is a nice option to have attached to a removal spell. And then Dauntless veteran can attack and buff all of your creatures. It's worth noting that it buffs itself, so it will attack as a three three, but it's also buffing your other creatures, which can enable some really, really good starts.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next up is blue black, which is a deck that cares about the graveyard. Dreadwing scavenger is a really nice flyer. It's going to filter your draws, fill your graveyard and then eventually attack as an even bigger flyer that has deathtouch, which is really nice. Rune sealed wall is a great defensive option to have on the ground. It will sit there, stop your opponent's attacks and also fill your graveyard while also filtering your draw. So you can find your good spells. And then Revenge of the Rats is a cool card to have as a finisher in this sort of deck where you can mill it over early or discard it to a card like Dreadwing scavenger and eventually flash it back in the late game to get a bunch of rats and overwhelm your opponents.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next up is green white, which is a deck that cares about plus one, plus one counters. Good fortune unicorn is absolutely stellar in this sort of deck because all of your creatures are going to enter with plus one, plus one counters on them, which fuels your synergy and also just makes your creatures bigger so they can attack better. Wildwood scourge is also really good in this sort of deck because as plus one, plus one counters are going to put on your other creatures, you'll also be growing a hydra and that will be making two threats that your opponent has to deal with. And then Inspiring Paladin is a really nice common for this deck because it helps all of your plus one, plus one counters, creatures attack more effectively,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">which is nice to have. Next is blue red, which is a deck that cares about casting instants and sorceries. Balamore, Battlemage Captain is a really nice two drop for this deck because it's going to be buffing all of your other creatures and sometimes you don't have as many creatures in play. And so Balamore in this case will be able to buff up those creatures that you do have while you're casting the instants and sorceries that are filling your deck. Think twice is a nice card to have access to in this deck at common because you're going to be able to cast two instants or sorceries for just one card. So you can cast the think twice, flash it back and trigger your cards that care about casting instants or sorceries twice. And then Firebrand Archer is a really nice two drop for this deck as well because you get this down early and then even if you're not able to attack,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">you're still pinging your opponent out of the game and it gets even scarier if you can manage to get multiples into play. Next is Black-Green which is a deck that cares about creatures dying. It's a nice value oriented deck and it uses a lot of the morbid mechanic which cares about when creatures died. Notably that does include your own creatures so as I talked about earlier with that one black common if you are able to sacrifice some of your creatures that can also trigger morbid. So Wardens of the Cycle is a really nice four drop. It's got a lot of value associated with it. If a creature died, you get to either gain some life to help stabilize or draw cards which is going to be the mode that you choose very frequently all attached to a reasonably sized body. Tragic Banshee is also a really nice card for this deck. If you're able to have a creature die,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">then you can kill pretty much anything your opponent has and otherwise you're going to be able to kill something small, pick something off, things of that nature. Though if you are able to cast this post combat, that's oftentimes the best time to do it because if anything died in combat, then your Tragic Banshee is able to get full value. Needletooth Pack is also a really nice option to have because it's going to grow your creatures into truly formidable threats because if a creature died, you can put two counters on any creature you control which is really good already attached to a five mana four five which is totally reasonable stat wise anyway. If you are playing against this deck, be very careful when you do decide to make trades because if your opponent manages to slam one of these cards post combat or any morbid payoff, that can be really bad for you so maybe be a little bit careful with win making trades.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">And if you are playing this deck, try to put your opponent into situations where they are forced to trade so put pressure on their life total potentially or make attacks with creatures where they feel compelled to block because maybe you have a card that cares about you attacking that turn like a raid creature or something of that nature. Next is Blue White which is a deck that cares about fliers so Empyrean Eagle is a really good three drop for this deck, three mana for a two three flier is already good stats. And then giving your other creatures with flying plus one plus one is going to do a lot of work buffing your team. Dazzling Angel is also really nice in this deck, because a lot of the times, Blue White fliers decks are going to want to race your fliers are not the best at blocking because they're paying a premium to get that evasion so they're going to be slightly smaller than your opponent's creatures. And so being able to gain some life to help you win racing situations is going to be really nice and dazzling angel helps with that. And then they bloom trick is absolutely stellar in this deck.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">It's really good in pretty much every single blue deck, but especially in this one if you have cards like Empyrean Eagle, where it's going to buff up those two one one fliers you get, you can tap your opponent's biggest creature to once again help you win the race in the air, and then the one ones can either be used on chump blocking to help you while you're racing or just continue pressuring your opponent's life total so a really good card to have access to in this deck. The next deck is red green, which is a deck that cares about having big creatures specifically creatures with power four or greater Ruby daring tracker is an excellent card in this strategy coming down on turn two and ramping you towards those big creatures that will then be payoffs for your other synergies and also for Ruby which will let her attack as a bigger threat. So slumbering Cerberus is also a nice card for this deck, because the way to get your four powered creature into play on turn two to enable those synergies really nice and early, it is sometimes a little bit tricky to get attacks with this card,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but anytime you're planning on casting a removal spell, you can attack with the slumbering servers and get damage in that way, and a lot of the times your opponents are going to feel compelled to block it anyway so they don't just take chunks of for damage. And oftentimes the downside can be mitigated that way, and it does feel your synergies specifically Garyx uprising is a really good combo with slumbering Cerberus because if you play servers on turn to Garyx uprising on turn three, you already have a creature with power four or greater so you'll get to draw a card and Garyx uprising can really be a card advantage engine if you build your deck correctly and have lots of creatures with power four or greater so keep that in mind as a nice tool to keep the big creatures flowing. And then we have white black which is a deck that cares about life gain being dish Panda is a really cool addition to this deck for manna for a three two that gets bigger when you gain life, and when it dies you're able to return a creature from your graveyard to the battlefield depending on how big the Panda is so that's pretty nice as a payoff. You also have access to a cat collector, which is a card that makes a food token so it will be able to gain you some life on its own,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and also can help you gain an army by making one one cats, when you are gaining life which is quite good, and then a card like vampire nighthawk really thrives in this deck because it's an evasive creature that has death touch but more importantly life link which means that you can get the vampire nighthawk down on turn three, and your opponent doesn't have a big flying blocker or big reach so you're going to be able to attack them with the nighthawk every turn gain life and fuel all of your synergies like your fiendish pandas and your cat collectors. And so that's going to be a really nice card to have in this deck. Next is blue green which is a ramp deck that cares about playing lands and having big spells to play cat Yova benthic druid is absolutely stellar in this deck, whenever you pay a land come into play, you gain one life and draw a card, the stats on the creature are not the best because it's just a five minute three three, but you get so many cards, and you gain a lot of life if this sticks around in play.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">And so we just absolutely stellar grow from the ashes is a really good synergy piece in your ramp deck. If you have to cast it on turn three, that's totally nice it ramps you up to your turn five plays, but it's even nice in the mid game because you can cast it for five minute, get that kick or get to lands into play and trigger landfall on the cards you have that do care about landfall so that's really nice as well, and can also enable some splashes if you are trying to do that grappling kraken is another really cool card in this deck, because the big creature, and then whenever a land you control enters, you can stun your opponent's creatures, and that will really help you not only swing into win the game but also slow down their aggression if they are pressuring you so a nice tool at the top end of your curve. Finally we have black red,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">which is a deck that cares about attacking your opponent and triggering your cards with raid perforating artist is a really good addition to this deck three men for a three to death touch that if you are able to attack will put your opponent into a tricky situation where they either lose a bunch of life or start learning losing their permanence for cards from hand so perforating artists, it's just a nice tool for this deck infestation stage might not be the card that immediately jumps into mind when you think about nice attacker, but it's really nice in this deck because it can pretty much always attack and you're always going to be okay with the result, you can attack with your one one if your opponent trades, you get a one one flyer that can then continue attacking and triggering your raid cards, or it attacks and your opponent decides not to block, and you can then play your raid cards and benefit from that as well. Strongbox Raider is just a really nice for drop for this deck for a five two is not the best stat line but the fact that it enters and gives you a card that you can play on your next turn is going to be really nice and it even gives you a little bit of selection to go with it so that's a really nice tool to have in your black red deck. Next up are the combat tricks at common to be aware of. So in white, there is a fleeting flight,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">which is going to be one man for plus one plus one counter and preventing all combat damage, it can also give it that evasion fleeting distraction is definitely one to be aware of in blue, giving a creature minus one minus Oh so not a huge stats change, but drawing a card so if you do manage to win a combat using fleeting distraction, it puts you way ahead so be careful from that from your opponents, fake your own death in black, which can be used to retrigger enters the battlefield effects while trading in combat and even making a treasure to ramp things out or things of that nature. First strike is a typical red combat trick, plus three plus Oh first strike is just really solid, and then giant growth one man and plus three plus three a very classic combat trick as well.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">There are also several mass pump effects that you should be aware of at common there is goblin surprise to give all creatures plus two plus all of your creatures, plus two plus oh until end of turn, it can also be used to make someone once, but that plus two plus two plus two is a big one if your opponent makes a big attack, you should keep that in mind, clause out in white is also a mass pump effect that can be used at instant speed to give creatures, a big power boost but also a toughness boost. So that can be pretty scary as well plus two plus two, it isn't uncommon but still can definitely end games that overrun it uncommon, it is a sorcery,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but it's also the sort of car that can end games out of nowhere if there's a big board stall, and you have this card, you really need to try to end the game in a hurry because it just adds so much power and toughness to the board and trample which makes it really really hard to deal with if your opponent can cast this with any significant board presence, triple green is a little bit tricky, but just keep this card in mind if your green opponent seems unwilling to make trades or you suspect they have it or if it's game two or three and you've seen that they have it. Next are some trap cards to avoid, Hidetsugu's second right has the potential to be a game ending card, but the problem is is that it's only good in those very narrow situations where your opponent has exactly 10 life, and you don't always have that much control over your opponent being at 10 life, because even if you manage to get them there,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">they might have a card that gains them life and then all of a sudden you're Hidetsugu's second right is useless. If you don't have it in your hand, you're then in this tension spot of do I get them to try to get them dead, or do I just leave them at 10 life, and then see what happens, and it's just overall a card that you should avoid. Exsanguinate is also a card that you should be avoiding, because all it does is change the life totals, it doesn't help you on the board, and that is not going to be good enough in a lot of cases. Sure you'll get to those games where you cast it for like eight mana and win the game,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but a lot of the times you're going to be in the early turns and just wish you had a blocker or creature that could attack, or really anything except the Exsanguinate so just leave this one on the sidelines as well. And then Bolt Wave, similar to Exsanguinate, doesn't affect the board, and so even though in Constructed a card like this might be useful when you're able to build your deck around having these sort of direct damage effects, in draft you really want to be having cards that care about the board state that help you advance your game plan, and Bolt Wave just really doesn't help you do that. Next up are some combos you can assemble with just commons and uncommons. First up is the combo of Healer's Hawk and Ajani's Pride Mage. This is a combo that was good enough to win a pro tour in Constructed, and Healer's Hawk being able to be an invasive 1/1 flyer with Life Link,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">following it up on your curve with Ajani's Pride Mage so that when you attack with the Healer's Hawk, you gain the life, Ajani's Pride Mage grows, gets a counter, and overall just forms a combo that really has to be broken up or you just end up with an unbeatable advantage, especially if you're on the play, your opponent just gets put under so much pressure, and you just end up with a huge creature and actually a decent life total because of the Healer's Hawk. Next is the combo between Mischievous Mystic and Strix Lookout. Mischievous Mystic cares about when you draw your second card each turn, giving you a 1/1 flyer, and Strix Lookout is a consistent way to draw extra cards by paying that 2 mana to draw a card,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">then discard a card. So if you're able to get both of these into play, then you can basically spend 2 mana every turn to draw a card, discard a card, and make a 1/1 flyer, which is a really nice combo to assemble, especially because both of these cards are cheap. Next is the combo between Dragon Trainer and Runaway Together. When you play the Dragon Trainer, you get a 4/4 dragon, and then you don't really care about the 1/1 that's left behind, so if you use Runaway Together,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">you can bounce one of your opponent's creatures, pick back up the Dragon Trainer when you bounce that to your hand, and then play it again and get another 4/4 dragon. Runaway Together is a really good synergy piece with enters the battlefield cards. And then finally, there is the classic combo of stealing your opponent's creature and sacrificing it, so using a card like Involuntary Employment, you can take your opponent's creature, hit them with it, and then spend a mana to sacrifice it to Hungry Ghoul before your opponent would get it back at the end of turns, so turning it into a really nice card for your deck.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next is the mana fixing in this set. There are 10 dual lands that will sometimes replace the basic land slot in your deck. That will happen 50% of the time, so there's one for every color pair, and those cards are definitely nice for helping your mana fixing. There is also Evolving Wilds, which can be used to fetch for lands of your colors or your splash colors or things of that nature. Campus Guide can similarly be used if you're splashing. And then Goldvane Pick is not fixing in the conventional sense because it doesn't get basic lands, but if you have a Goldvane Pick, it can definitely be a supplemental source of a color,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">because then when you're attacking, you're getting treasures, which can of course be sacrificed for any color. There's also some extra mana fixing in green at common. Bushwhack can be used to search for a basic land card, which means you can use it to get your splash colors or just fix your mana, and then Grow From the Ashes, as we already discussed, can be used as a way to get mana of any color that you care about from your basic lands. Final tips. Artifacts and Enchantments are certainly killable, so play accordingly. There's cards like Cathar Commando, which is just a reasonable creature,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and also something like Reclamation Sage at uncommon in green that's going to be able to destroy Artifacts or Enchantments. And so if you are playing a game where maybe you have an Enchantment-based removal spell and a normal removal spell, maybe use your removal spell that is going to be normal on your opponent's best threat so that they can't potentially get back their good creature by playing an Enchantment or Artifact removal spell later. Or if you have a really good Enchantment that you have to pay mana into to get value out of it, you can also do something like, \"Okay, I'm going to activate this as many times as I can because I know that my opponent might have a way to kill it.\" So just know that there are ways floating around to kill Artifacts and Enchantments, so you shouldn't assume that they are untouchable. And then the final tip is the archetypes are a bit more general in this set, so prioritize raw power level a bit higher.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">In a format where there's hyper-focused Synergy-based decks, sometimes you're willing to take a hit in power level for a card that really makes your deck come along. But in this format where you have decks like flyers or caring about playing big creatures or things of that nature, you care a bit more about just having raw card quality versus cards that always fit together perfectly on Synergy. So make sure that you do have that emphasis on high card quality and maybe prioritize Synergy a little bit lower than you would in a set that has more Synergy-based archetypes. Anyway, that is going to do it for this video. Thank you so much for watching. If you made it to the end, leave #FoundationDrafter in the comments section down below. I hope you enjoyed it and I'll talk to you next time.</p>",
                "title": "FDN Nico Preview",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "InthisMTGFoundationsdraftguide,Iwillbecoveringeverythingyouneedtoknowbeforedivingintotheformat.Iwill",
                "level": 1,
                "publishTime": "2024/11/04",
                "readingNum": 3,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "6a422687fc8b49a0ab463472dd18dfe6"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}