{
    "props": {
        "pageProps": {
            "query": {
                "id": "6b9bdbb902d44706a78a375908127e99"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82215,
                "outId": "6b9bdbb902d44706a78a375908127e99",
                "articleOutId": "6b9bdbb902d44706a78a375908127e99",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">blue three four prowess ETB surveil two.<br> And a three four prowess is already just like I think that's a will have a list of cards that I think are just better in sealed light shell duo better and sealed because it has we've talked about before,<br> has that body that can tussle with the green creatures.<br> Plus what a combo like I'm never going to draft the deck,<br> probably that has light shell duos and long stock brawls in them.<br> That's fair.<br> But in sealed they were great, like having having that as a package,<br> and then deciding to pair my green with my blue gave me access to a couple of blue white rares on the splash and so that sort of chain reaction happened,<br> and I never thought I would leave two wix patrols and a stargaze in the sideboard of a deck that had black cards to play,<br> but I think that was right.<br> Yeah, and I think just light shell duo in sealed, but I mean,<br> we might as well talk about it now.<br> Yeah, the body the body is incredible.<br> And when you play duo and been to lands or been a land like light shell duo is very close to four minute three four prowess draw card like yeah it's it's rapidly approaching that in sealed.<br> Well,<br> and you're likely to write so much of the stuff in the format is either grindy,<br> or there's,<br> you're either going to have things that care about threshold or things that care about foraging.<br> And so light shell duo not only is giving you card selection off the top of your library but it's giving you synergy.<br> In terms of it, filling your graveyard to some extent.<br> Yeah, it's great.<br> Bumble flower share pot is much better and sealed that's a two minute artifact makes a food and you can pay five tap sack at sorcery speed to blow up and on land permanent.<br> I've had multiple black green decks that really want additional ways to make food right so you have because you're playing all of your forage stuff all of your two fours the draw card and they forward so just having that thing on turn two to make a food and then later on like you get it gets clunky but you get another removal spell colorless removal spell in your deck that can bonus points blow up class enchantments banishing light other opposing patchwork banners whatever like share pot,<br> I'm not saying you know play every single copy you have I've definitely like I'll play one of the three I have etc.<br> But it's a card that again you're really hoping to not play in draft,<br> unless you're like popping off with builders talent,<br> but in sealed I think it gets a lot better.<br> Yeah,<br> just certainly as colors removal but what you're talking about too with bringing the additional food along with it that matters a lot for the black green decks like I was building a black green sealed pool,<br> and what again had food stuff going on but was a little light on food.<br> And I initially in the build had the four in a black instant exile a creature or an enchantment.<br> And then I was like, wait a second,<br> I think share pots just like better in this deck because it gives me a food which was not intuitive for me at all but that that sort of thing can matter.<br> Yeah, yeah, that's great point.<br> Um,<br> you want to talk about card advantage and filtering and I have a little more into chat about stargaze and dire site,<br> but I think you've got a got a thought about a lot of these kinds of cards.<br> Yeah,<br> that's the name of the game to me and sealed like I've already felt just in Bloomberg draft that you're prone to you know mana screw mana flood mana flood,<br> especially if you don't actively include ways to combat it,<br> and I think in sealed it that is ramped up that tension of I mean I really want to draw an appropriate land spell ratio or once I hit my six or seven land drop I want to draw.<br> I want to draw eight lands unless I just have incredible mana sinks.<br> Like I had a deck last night with heat harvests that was really popping off and could use all of them and you know I had eight nine lands,<br> and was happy with that number of lands but I also still had filtering after I hit that point to not,<br> you know, draw my 10th 11th 12 lands which is important to.<br> And decks are generally less synergistic other than you know what we've talked about you're likely to hit salt I synergies,<br> but you're way less likely to hit the other synergies in the format.<br> So,<br> you just play the high quality cards and then you want to find as many of those high quality cards as possible and so you know mind spiral,<br> we talked about already,<br> something like Pearl of wisdom the two in a blue sorcery divination like sign me up that's that those are like reasons to play blue for me I'm probably not splashing.<br> Pearl of wisdom but you better believe I'm splashing mind spiral in my black green decks if I have any sort of fixing that can do it and the other thing that's really impressed me is discard and I want to chat with you about this because you've said that maybe it didn't hit you that way I have been on the end of some absolutely backbreaking psychic worlds the two in a black mind rot variant.<br> Yeah, I haven't,<br> I will confess that is the one of the three I'm in a face bandits hall the chat the class enchantment that I can't believe I ever thought was going to be a good card,<br> and I have faced the ruthless negotiation the single black discard and then it has flashback for in a black and when you flash it back you get to draw a card.<br> I have faced those cards and not been impressed I haven't seen much in the psychic world department so perhaps that's different.<br> Yeah,<br> it's been good enough like I think that's that's the classic thing and sealed right does the mind rot and divination get better.<br> And it has held true for me here.<br> My feeling about the other two so I'll just speak to ruthless negotiation and bandits hall is that that like little pinging of cards doesn't,<br> you're usually able to like if you're the kind of deck,<br> who is playing a ruthless negotiation or a bandits hall,<br> you're not that aggressive right you're doing a sort of attrition war life.<br> And if your opponent is also on the attrition war life.<br> You can usually card out of it like it doesn't really set you back that far.<br> But perhaps psychic world packs, more of a punch.<br> Well like so for example,<br> mine spiral like so many of my matches have keyed around who resolves my spiral,<br> that's so interesting and psychic world like it's hard to not have mine spiral be as the one of your two two cards in your hand and like,<br> so that getting hit by by the discard has been particularly brutal but one of the other things I want to chat with you about is you've talked about your Naya deck right where you main red white in the creator challenge,<br> and you sent me those decks ahead of time,<br> and you you initially said you thought you were going to be a good guy.<br> You initially said you thought you liked green white the best.<br> And I was like,<br> I don't know I kind of like red white because you have these flame clash flame cash geckos which give you filtering.<br> Yeah,<br> like did it did those pan out to be as good as I thought they would be in that deck.<br> Did you find yourself rummaging with them?<br> Not really, not really interesting.<br> I just didn't find like,<br> but I think part of it is that like when you're if you're at a point with your red white agro deck,<br> where you're rummaging, you've lost the game,<br> because you're not even gonna like you're getting card filtering,<br> but you're getting card filtering at the cost of mana.<br> And by that point your geckos probably blanked like I didn't find like,<br> I think that's a fair assessment of the deck,<br> but I didn't find that it played out that way.<br> Like I've played against that card once and sealed and it felt like I had to kill it over the course of the game where I was going to lose eventually to the filtering that it provided.<br> Interesting, but in an in an aggressive deck from your opponent?<br> No, I played against almost no aggressive decks in sealed.<br> They're because they're not great.<br> They're not great.<br> Another thing that I've had come up just coming back to card selection examples and this really goes to sideboarding.<br> So we can dovetail us into sideboarding after we talk about cards but I saw an opponent who had two long stock brawls.<br> Well,<br> what's a great way to combat long stock brawls is high stride the single green plus one plus three untapped trick like that's the kind of thing like,<br> especially once you see like two copies of something,<br> something you know your opponent's going to be playing like how you choose to engage with that doesn't have to be a full on deck swap,<br> but you want to be thinking about okay, I'm seeing the downwind ambushers.<br> Can I get rid of my x</p>",
                "title": "BLB Sealed3",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "bluethreefourprowessETBsurveiltwo.AndathreefourprowessisalreadyjustlikeIthinkthat'sawillhavealistofc",
                "level": 1,
                "publishTime": "2024/08/19",
                "readingNum": 5,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 5,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "6b9bdbb902d44706a78a375908127e99"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}