{
    "props": {
        "pageProps": {
            "query": {
                "id": "8ae42331254c4f8aa29c7066372966d1"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82241,
                "outId": "8ae42331254c4f8aa29c7066372966d1",
                "articleOutId": "8ae42331254c4f8aa29c7066372966d1",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">it does you know gain life and it is a strong card so it can work in white black and as far as like Lizard payoffs like the stuff that cares about having damaged your opponents so stuff like Fireglass Mentor does play well with fliers. I could certainly imagine like Fireglass Mentor specifically as a card that you might be interested in splashing in a white black deck where you have a lot of fliers or other ways to like make your opponent lose life maybe like a Starscape Cleric which is a flier that can probably attack but also maybe there will be a board where it can't attack but you you know trigger Lifecrede Duo to trigger Starscape Cleric to make your opponent lose life to trigger your Fireglass Mentor. So yeah I mean Lizards is a less drafted but not very much less successful archetype than the other top archetypes. I think that there are reasons for why it's less drafted even though it can be very good I think that it kind of hinges on like a smaller number of cards is my guess without having extensively studied it so I don't know I think there's something there but I think it comes up a bit less frequently I suppose. Plume Creed Mentor the blue white gold uncommon works well with bats this is true. Plume Creed Mentor triggers on any flying creature not just birds entering and needs you to have some non-flying creatures which your white black deck often will so like Plume Creed Mentor is also a reasonable card to splash in white black. All right I'm going to wrap it up there thanks for listening everyone and I will be back next week with another archetype chosen via Patreon poll. We're pretty firmly into the swing of things now with Gloomborough I'm feeling less behind after needing to get a bit of a slower start with this set than usual and I think we still have a ways to go before we're thinking about another set so we'll just keep doing our normal thing here so have a good week and I will be back next week bye for now. Prepare for light speed.</p>",
                "title": "BLB Sam WB4",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "itdoesyouknowgainlifeanditisastrongcardsoitcanworkinwhiteblackandasfaraslikeLizardpayoffslikethestuf",
                "level": 1,
                "publishTime": "2024/08/19",
                "readingNum": 1,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 9,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "8ae42331254c4f8aa29c7066372966d1"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}