{
    "props": {
        "pageProps": {
            "query": {
                "id": "8b15aa6695a1408f9af1518e7d8044f4"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82214,
                "outId": "8b15aa6695a1408f9af1518e7d8044f4",
                "articleOutId": "8b15aa6695a1408f9af1518e7d8044f4",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">,<br> and my blue and red piles were extended, like okay, I scroll down,<br> I had to scroll down almost and had good blue and red cards had a blue rare had a mockingbird had another red rare maybe was an amber heart challenge I don't remember.<br> And so I was like, Oh, great, I'm supposed to build blue red,<br> and I built blue red and I was like, Oh, really,<br> what are we doing this with my life.<br> And I was like, well, let me just check out like,<br> if I can play green and had like two heaped harvests and a couple three tree reavers.<br> I had a hunter's talent, and it just was enough, like,<br> I could just play salt I because the blue cards I think we'll talk about this in a little bit but I think blue gets quite a bit better and sealed I know I think you get think it gets better but maybe not quite a lot better and I was just able to play base green salt I and I used all of my green cards,<br> like even though the pile was very short and it.<br> After I built it I was like, wow,<br> like I'm pretty sure the pool says I'm supposed to be blue red but just adding green and playing salt I just looks infinitely better because the individual card call is just so much stronger.<br> Yes, and that's so so important like, because again like it comes to.<br> I think you're mostly going to see green and I think green black specifically and whether that ends up being salt I or gender abs and or whatever like if people can splash.<br> I think that's what you're most likely to see is where you're going to get your body's removal and good rates and fixing.<br> And then you're also going to have likely in that you'll have some amount of squirrel food synergies I think that's the easiest inherent synergy to come together and sealed.<br> It puts that that already is putting a pinch on the agro decks now like I said,<br> I've been run over by red white agro by red black agro like it can happen,<br> it's a blue Ben ran people over with his blue white agro deck,<br> it can happen I'm not saying you can't win.<br> And I'm not saying like, you should try like even if your pool is saying,<br> this is the deck that you should try and build something else like the deck I was supposed to play again in the empty geo creator showdown 5k yesterday was red white I mean I sent you my pool I was like,<br> I have some options I had some some Naya stuff I really could have done any combo of the Naya colors I settled on red white,<br> and like it ran some people over.<br> And then it also got brick walled by some tree guard duos and then that's just,<br> that's how things are going to happen sometimes.<br> Yes,<br> I agree that you're hoping to not have to play an aggressive deck and I think this format is slower like I would already say bloom burrow is not a crazy fast format like it's powerful.<br> Yeah,<br> it's powerful when the synergies pop off and it's grinding but the sealed format especially feels slow to me like,<br> like on average,<br> like for example mine spiral the four and a blue sorcery draw three you can give to fish if you do lock a thing down like that card is insane and sealed I think like I cannot imagine cutting copies of it every time my opponents have resolved that I just like all of the air goes out of me and every time I resolve it.<br> I just feel like great, like can't lose from this point it's just such,<br> such a huge boon.<br> Yeah, yeah, it's pretty, pretty good.<br> I haven't really played that much minesboro in sealed this week,<br> now that I'm thinking about it maybe that's some equity I left on the table.<br> I love that garden.<br> Yeah.<br> Um,<br> I will say also that the green beatdown decks can often go over the top of non green agro decks that was one of the things I swapped into and we'll talk about some,<br> some edges in just a second but that's one of the things I swapped into like I had my red white deck.<br> I was facing a green deck like,<br> oh Caleb had this ridiculous red green deck in the showdown.<br> He went red green to drop the mana dork that has expend for get a counter on it.<br> Like that on to turn three played a second one and a cash grab grew them both.<br> Turn four,<br> he played the five mana four five expend for it's a plus two plus one trample did that on back to back turns I was like,<br> what, what is this, what is this nonsense,<br> but to try and I was like well I can never beat this with my red white valiant deck.<br> So I just decided into red green I was like I'll just try and do the thing you're doing and try and go toe to toe with you with some big creatures,<br> and I was able to at least win game two against him,<br> which I definitely would not have been able to do I think if I had my little,<br> little mice running around.<br> So I think just knowing that and that's part of the thing that we're going to talk about here in the last chunk of this episode is playing best of three.<br> I think you just really want to build multiple decks,<br> if you're doing this on arena, you, there's no good way to do this,<br> you have to what I do is I.<br> You export your pool if you don't know how to do this you can just like sort of drag as many cards into your pool to get to 40 decks,<br> and then click like okay I'm done building my deck and then don't enter a match and then above the deck box picture.<br> There's an add to decks button.<br> Add to decks,<br> and then go to your deck lists and export that deck list to seal deck tech.<br> So build your deck in that client,<br> and I will take screenshots of the decks that I am happy with.<br> And so that I have those ready because you only have whatever two and a half minutes for sideboarding.<br> And if you're going to deck swap, it's just you just have to know like,<br> oh,<br> this is what I'm doing and you're just already doing and you want to be thinking about it in game one,<br> like know if you're going to do this in game one so you have all that time and sideboarding and then you get to the decks.<br> In paper sleeve up multiple things whatever like I've done this before and paper sealed tournaments.<br> I'm not saying you always have this option like sometimes you're just going to have your clear best deck and that's it,<br> but a lot of times I think you will want to be thinking about it in the next level.<br> And sometimes it happens it comes up like I,<br> the red green deck I just talked about like I didn't think about that.<br> Prior to the tournament.<br> I wasn't thinking oh this red green deck will be good but as I'm seeing this deck play out against a green deck I need to get my own green beefy bodies as well.<br> And how can I do that.<br> So,<br> you may not have thought about it beforehand but you just constantly have to be thinking about this this like next level war in sealed up my opponents playing this,<br> how can I combat that strategy,<br> because I think oftentimes people aren't thinking that way and so you don't get the like,<br> you know, they're doing the reverse reverse against you,<br> right deal like you're just usually able,<br> they're going to usually stick with what they have,<br> and especially if it's a powerful thing I played against someone with two downwind ambushers.<br> And I was like, Oh,<br> I need to try and cut as many one toughness creatures inside boarding as I possibly can.<br> And there's no way that they're going to be like,<br> well he's probably cutting one toughness creatures so I'll cut my downwind ambushers like,<br> right, that's not happening.<br> Well there's never a leveling war because one of the decks is better.<br> The person with the better deck is just like great I'll crush again.<br> Sign me up.<br> Exactly, right right right.<br> Um,<br> so I think your biggest edge in sealed is going to come from two places.<br> Your niche synergistic card selection like what you choose to put in slots 17 through 23 is I think where you get a big edge and then sideboarding.<br> So, some card selection examples from the week for me.<br> I had a pool with four long stock brawls.<br> The single green fight spell with gift of fish,<br> put a plus one counter on your creature.<br> So I knew I was definitely gonna play green.<br> And I was hoping to play green black I saw that I had two wix patrols the six mana flame tongue kabu's.<br> I had a stargaze that's the X black black draw spell which is also excellent in sealed.<br> But that color pair didn't really give me much on all my creatures were either small or at the top of my curve and so I didn't really have a way to leverage the long stock brawls,<br> but blue gave me three light shell duos,<br> the three in a</p>",
                "title": "BLB Sealed 2",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": ",andmyblueandredpileswereextended,likeokay,Iscrolldown,Ihadtoscrolldownalmostandhadgoodblueandredcar",
                "level": 1,
                "publishTime": "2024/08/19",
                "readingNum": 2,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 9,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "8b15aa6695a1408f9af1518e7d8044f4"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}