{
    "props": {
        "pageProps": {
            "query": {
                "id": "afeb3aeb1edc4d988a6f2c3a63cff467"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82217,
                "outId": "afeb3aeb1edc4d988a6f2c3a63cff467",
                "articleOutId": "afeb3aeb1edc4d988a6f2c3a63cff467",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">are so much more likely to stall out.<br> So it's got the activated ability three and white give your team plus one plus one and threat of activation on that's really can enable attacks without you having to spend the mana.<br> A very good card and sealed much better than it is in draft.<br> And then just a slew of card advantage cards we've talked about mine spiral pearl of wisdom psychic world like divinations and mine rots getting better.<br> Alani has pathmaker Hello,<br> way better and seal the three and a red for two lets you exile the top card your library and play until the end of your next turn that that's the type of card you want and sealed is just reasonable body plus card advantage.<br> This is also the second like medium draft card on this list.<br> The in thorn played intimidating now Alani is pathmaker it's for power not in green it's a four mana for power thing not in green,<br> which lets you tussle with greens for mana three fours and four fours,<br> it's so important.<br> Super important Zaza caps brews another one this just falls in the card advantage card filtering like you just want to make sure that you draw the right ratio of lands and spells.<br> And this is a tormenting voice is is worth,<br> including if you're playing red,<br> I might go so far if I had good fixing as to splash Alani as pathmaker if I needed bodies or wanted wanted card advantage but Zaza caps brew is not not on that life.<br> Yeah. bandits talent is another one.<br> You've said you've not like this card.<br> I'm not buying what you're selling here on bandits talent.<br> Well, but it's it's the bandits talents,<br> plus the psychic world's like you can you can really pinch your opponent's hand,<br> my brother have you tried affecting the board in limited in 2024.<br> I mean, but sealed hasn't been that for me I don't know,<br> I have literally played against you and your opponents are just like I attack your hand well I add cards to my hand,<br> your hand like a lot of high toughness creatures.<br> A lot of battles for card advantage.<br> Okay. It's been been salt I salt card advantage wars.<br> So I don't know I have been impressed with bandits on psychic world,<br> but maybe I'm leading the listeners astray,<br> maybe the green decks just hit too hard.<br> About the second line of text on the first class level on bandits now I just like had shortcut it in my mind to be just discard a card,<br> but it's either discard.<br> Basically two lands or a non land card,<br> because I went to try and just discard a land on arena.<br> You either pick your two lands or pick the spell was like, oh okay,<br> it's a little bit more annoying.<br> Oh, also speaking of resolving things.<br> I don't know if I just haven't cast mind spiral on arena yet I probably haven't would be my guess.<br> But on empty Joe you have to target the player that draws two cards and my instinct is always to target who I'm gifting first first time I guess it.<br> I gave my opponent three cards, three cards because I was like,<br> I got to the third step where you choose the gifted person and I was like this is really weird I already did this and click your land and I was like,<br> Oh,<br> I had a similar thing on arena yesterday the white white uncommon that either exiles a thing,<br> and then comes back with a counter or you exile and you give them a fish.<br> My opponent was trying to skyscraper duo, a creature,<br> they're trying to blink a creature I was like, Oh,<br> I'm going to exile it and respond so they don't get the re ETB and arena was like,<br> Are you sure and I was like, Yeah, I'm sure.<br> Get that thing dead and then it came back and turn with a plus one plus one counter on it.<br> Rip.<br> Pour one out.<br> Stargaze we've alluded to Stargaze is incredible.<br> I can't imagine ever not including it and it is a reason to play black Stargaze is a house and sealed blacksmith talents another one I've played with blacksmith talent a ton more this weekend knew it was good but I hadn't come from playing against it but I have like with it.<br> I played with it in draft and in sealed.<br> It's just incredible and sealed just making every creature into an insane threat is very taxing on your opponent's removal.<br> Yeah, I agree.<br> And lastly,<br> flame cash get go I think as much rummaging and filtering as I can get sign me up.<br> Attack your hand add to your hand profit when it's right.<br> So do you think you're going to do best of three next weekend on Saturday.<br> Have I can I commit No, there's no way you're sick.<br> You just love pain and punishment and you're going to play best of one.<br> Well, yeah, I don't know,<br> maybe I'll maybe I'll do best of three just despite you to prove you're wrong.<br> That'll really show me.<br> Like I did three best of three runs and I didn't qualify Ethan you happy.<br> I can't wait for that message.<br> Yeah, I'm sure it'll be coming.<br> That'll be great.<br> Anything else before we go here.<br> No, that's I think that's a great,<br> great place to and it's appropriate phrase for sealed to wrap us up.<br> Wrap us up.<br> Yeah. And good luck to everyone competing in the arena open this weekend.<br> Yeah. All right.<br> Thank you as always.<br> Salty pretzels for intro and outro music.<br> Make sure you give it a listen.<br> You can find all of our content at Lords of limited.com there's links to our tier list courtesy of Ben and 17 lands links to our episode backlog our YouTube channel our respective twitch streams.<br> Our merch courtesy of T public as I sip my coffee out of my Lords of limited mug.<br> All that stuff is available at Lords of limited.com.<br> If you've got any feedback about the show or any questions,<br> shoot us an email at Lords of limited at gmail.com.<br> Thanks so much for listening and we'll catch you next week for another episode of Lords of limited.<br> Thanks, everybody.<br> See you later.<br> Later.</p>",
                "title": "BLB Sealed 5",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "aresomuchmorelikelytostallout.Soit'sgottheactivatedabilitythreeandwhitegiveyourteamplusoneplusoneand",
                "level": 1,
                "publishTime": "2024/08/19",
                "readingNum": 8,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 5,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "afeb3aeb1edc4d988a6f2c3a63cff467"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}