{
    "props": {
        "pageProps": {
            "query": {
                "id": "b89fafa3cb7b4dc9b270368a21cf1209"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82515,
                "outId": "b89fafa3cb7b4dc9b270368a21cf1209",
                "articleOutId": "b89fafa3cb7b4dc9b270368a21cf1209",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">So, pros and cons to both of them, but they both work pretty well there. Builder's Talents deck would often like to be Barkform Harvester decks. Barkform Harvester is the 2/3 changeling with Reach that you can spend 2 mana to put a card from the bottom of your graveyard onto the bottom of your library. You generally want to be planning to play a very long game. Ideally, you would like to have enough card draw and, optionally, cash grabs to get through your entire deck. And you really don't want to find yourself in a spot where you're getting deep in your library and you have to find a way to make attacks. Being able to just load up on your defensive creatures and hang out and not make attacks, even in the games where that doesn't end up where you do kill your opponent before drawing through your whole deck, the flexibility in your strategic positioning in the game and your ability to not devote resources to finding profitable attacks and to instead only focus on playing a defensive game gives you value that's not obvious with the...</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">like, that you wouldn't necessarily attribute to the Barkform Harvester. The Barkform Harvester might not... maybe you haven't even drawn it, but the simple fact that you didn't need to worry about making attacks might let you use your other cards better in a way that lets you win the game directly or indirectly because of the, like, inevitability that you have, regardless of how it's realized. Also, because these decks are prioritizing Fountainport Bell, it's actually possible to get real value out of Barkform Harvester putting cards back in your deck without drawing your entire deck. Because you can activate Barkform Harvester a couple of times to put your best cards after you've used them from your Grevyr and Vladimir library, then you can draw and cast a Fountainport Bell and choose to search your library but fail to find, assuming you don't want to land at this stage in the game,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">because it sounds like we've already cast a bunch of cards, used a bunch of mana, we probably have a good number of lands, we're probably trying to put more spells and fewer lands in the deck. So you cast a spell, you choose to search, you fail to find, and now you've shuffled all those good cards that you put on the bottom back into your deck, so you've improved your spell density and your card quality, and now if you redraw any of those cards, you're better off than you would have been if that hadn't happened. So you can actually get Barkform Harvester value more easily when it's combined with Fountainport Bells, which is going to be relevant in any Barkform Harvester plus Fountainport Bell deck,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">or you can sub Heaped Harvest or anything else that shuffles your library for Fountainport Bell. Incidentally, Heaped Harvest, another card that's totally fine with Builder's Talent. Yeah, so, you know, without listing literally every non-creature card and/or every card in the set that makes food, that's an overview of some of the cards that you're looking for with Builder's Talent. Color combination-wise, I think that you're probably going to be red less than the other colors, though, you know, I say that as someone who has just always read less than the other colors in this set,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but I think red is less naturally set up to play the long control game than the other colors, even though I did talk about how I could do that. I've been pretty happy with Builder's Talent with any of the other colors. I kind of like pairing it with blue, even though blue isn't really contributing that many non-creature permanents, just because the card draw spells and stuff help. But, yeah. Part of why I didn't really try to put this in a specific color combination is this is one of those decks where, again, because Fountainport Bell is such a big part of what's happening here,</p>",
                "title": "builder3-1",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "So,prosandconstobothofthem,buttheybothworkprettywellthere.Builder'sTalentsdeckwouldoftenliketobeBark",
                "level": 1,
                "publishTime": "2024/08/24",
                "readingNum": 3,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "b89fafa3cb7b4dc9b270368a21cf1209"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}