{
    "props": {
        "pageProps": {
            "query": {
                "id": "dd6d11a111a345b6b5256b6b356f95a4"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82511,
                "outId": "dd6d11a111a345b6b5256b6b356f95a4",
                "articleOutId": "dd6d11a111a345b6b5256b6b356f95a4",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">But with that one, every counter is worth, like, at least twice as much as it's worth on another creature. So I think that's a pretty reasonable one to look for specifically with Builder's Talent. Another card that's particularly great with Builder's Talent that is a hidden gem is Night Warrel Hermit, a good defensive one for a body that wears counters nicely with vigilance and becomes unblockable threshold. Yeah, so I haven't really given a lot of thought to Night Warrel Hermit, but it is very true that putting extra counters on a vigilance unblockable creature is definitely nice. I think that that's actually something that I should look for some in the future. Is one Builder's Talent enough to build your deck round seems clunky to me. So it's not really, like, more of them is more clunky than fewer of them.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Clunky isn't really the concern. Like, the card does want you to be playing a long game, and it is mana-intensive to get the full value out of, but it also does a lot to help you get to a long game. So it's not like Builder's Talent is only good if you have multiples. It's a question of how far out of your way are you going to support this card, and if you only have one, you can justify making far fewer concessions to it than if you have more than one. In my experience, they go fairly late in the draft, so if you have one and you've been drafting around it,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">you're somewhat likely to see another one, even though it's non-common, especially since as you're drafting around it, you're taking the cards that work with it out of the draft, so it's less likely that other people are going to be in a position to use one that they see in pack two or pack three. And I think the answer is, if you are set up to play a controlling game, you're going to naturally be interested in most of the cards that happen to work well with Builder's Talents, and so you can basically draft around the one that you have, and then you'll get like this particular powerful payoff more often if you have more of them, but the deck will still be coherent if you just have one and your other cards just work together as they work together, which is, you know,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">you have generally a controlling deck and your cards are all working toward that direction. On the topic of cash grab, how important is the number of squirrels you have? That depends on what you're trying to get out of your cash grab. Obviously in the case where what you're trying to get out of it is a food to trigger your Builder's Talent, you're going to need to have some squirrels. But Impulse is not that bad of a card. It's a pretty good card if you're playing a defensive deck. And then if you're getting extra value out of cards being in your graveyard because of threshold payoffs or things that get cards back from your graveyard in some way - that could be Parkform Harvester, it could be Builder's Talent, it could be Stormchaser's Talent,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">it could be Hazel's Nocturne, whatever. Or if you have cards that do something from the graveyard like Bonebind or something, Orator, the 2/2 that you can exile to return a creature from your graveyard to your hand, or Persistent Marshstalker, the 3/1 rat that you can return if you have threshold and attack with another rat. There are a lot of different ways for putting the cards in your graveyard to matter in this set. So as far as how much should you value cash grab, it's going to be in a Builder's Talent deck, it's going to be a function of are you doing other stuff that cares about your graveyard and do you have a squirrel,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">how often will you have the squirrel? How highly do I value Builder's Talent in a pack 1 pick 1 situation? I think of it as a premium uncommon. Like I'm not taking it over the strongest rares, but I would take it over most commons. Particularly because from pack 1 pick 1 you really get to plan your whole deck around it, so it's going to play pretty well. And I think that the decks that are drafted around it are pretty good. I think it would be totally reasonable if you don't have a preference for that, or if you have a preference for other strategies.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">It's not hard, it's the kind of card that's really like, you know, it asks a lot, so if you value flexibility and if a lot of your ideal expected range in a draft is more aggressive decks so it's really limiting your options, then it's easy to view it as a card with a high opportunity cost to take early. The way that I personally draft, I'm generally inclined to draft toward inevitability anyway, so it's not restricting my range or future picks very much. So this is very much the kind of spot where I think there are going to be a lot of packs where Weather Builder's Talent is right for any given person. Really depends on their biases and preferences, and the different pick will be right for different people.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">But if you are inclined to draft control decks or the kinds of decks where Builder's Talent is good, then it's very reasonable to take it very highly in the draft. Pick one is a fine place to take it as long as there's not a premium rare or top top top tier uncommon in the pack. In all honesty, I think Blue White's best archetype is Builder's Talent. I agree. I think that the birds thing isn't where it's at, and Blue White really wants to be just kind of generic control deck, and Builder's Talent is a very good starting point for a generic control deck. You said you've talked to other players and they agree with me on Builder's Talent being good, they draft the same way as you.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">So the specific conversation I'm referencing on talking to other players and Builder's Talent being good. So NeoMTG - I hope I have those in the right order and it's NeoMTG and not MTG Neo. I think it's NeoMTG. Neo_MTG on Twitter organizes a call with various streamers before the first arena open of each set and records that and posts it on Twitter as kind of informal, not highly produced content. And in that call, I don't remember who, but others talked about having drafted a bunch of Builder's Talent decks. So if you're interested in how they approach it and what they said about it, check out Neo_MTG's Twitter to find that recording and hear for yourself. It's hard for me to know if they draft it exactly the same way that I do or not without actually going through drafts with them.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Yeah, so I talked about Builder's Talent in a slower red/white deck. I do think there is some potential possibly for Builder's Talent in kind of a more normal red/white deck. It's weird, of course, because the 04 is doing so little for you and usually that's like a significant part of what the card's giving you. And I don't think you're naturally gonna have - like you don't want to be playing a bunch of bells. It sounds tricky to pull off Builder's Talent in most regular red/white aggressive decks. It's really nice that it's a source of Valiant triggers, but unless you have a bunch of Carrot Cakes, and even those aren't very good in red/white, it's hard to imagine how you're actually triggering the Builder's Talents to get the Valiant triggers,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">unless you're building it very differently as a control deck. In which case the Carrot Cakes would actually become pretty good. Alright, so I think that's gonna wrap it up, so thanks for listening everyone. Still, yeah, we haven't really gotten into previews, so we're still well in the middle of Bloomberg, so be back next week with more Bloomberg archetypes. So thanks for listening and have a good week everyone, and I will see you again then. Bye for now.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Prepare for light speed. [Music]</p>",
                "title": "builder4",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "Butwiththatone,everycounterisworth,like,atleasttwiceasmuchasit'sworthonanothercreature.SoIthinkthat'",
                "level": 1,
                "publishTime": "2024/08/24",
                "readingNum": 3,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "dd6d11a111a345b6b5256b6b356f95a4"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}