{
    "props": {
        "pageProps": {
            "query": {
                "id": "e30022f805ea44269612cde5d2b4fb7f"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82508,
                "outId": "e30022f805ea44269612cde5d2b4fb7f",
                "articleOutId": "e30022f805ea44269612cde5d2b4fb7f",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">[Intro music] Hi everyone, this is Sam Black with Drafting Archetypes, and today I'm going to be discussing a bit of a weird one. I'm going to be talking about builder's talent in Bloomberg Limited. So not a standard color pair, just how to draft around this one particular card. As always, notes are available to follow along at patreon.com/draftingarchetypes. So because this isn't about a color combination, I obviously don't have any archetype stats that I can point to to say like how good or how heavily drafted or anything this is. It's just I've had some success drafting around this,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">I've talked to some other people who have had success drafting around it, and I wanted to talk about what's going on with it. It's a card I believe it doesn't have great stats. I haven't looked at the average player versus top player stats on 17 lands or anything for it. I don't think it's very important. I know that the card is strong and performs well when you draft decks around it, and that it goes kind of late and doesn't do all that well on aggregate decks, and that's really all I need to know. So just looking at the card, obviously it's a slow card, like it makes an 0/4 and then costs a lot of mana to use.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">As far as its rate, like a 2 mana 0/4 is a decent locker. You would not play just like a 2 mana 0/4 with no other text, but a 2 mana 0/4 that draws a card like Wall of Blossoms or Wall of Omens is a very good card. And in this case, instead of drawing a card, you get a talent that has the ability to spend 1 mana to let you get +1/+1 counters whenever you play a non-permanent, or whenever a non-permanent enters the battlefield under your control, which is relevantly different in this format, and then spend 5 mana to return a non-land permanent from your graveyard to the battlefield. So how much value you're getting on spend 5 mana to get something back kind of depends on what you're getting back. In this format, you're usually not going to get a 5 mana card out of it,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but you will get a 2 or 3 mana card out of it, and so you kind of get that full card that you would get off of Wall of Blossoms or something. It's just you don't get it as a card in your hand, so it can't help you hit your land drops or something like that. But the value's there, and then you also get whatever value there is in whatever number of +1/+1 counters you're making. I'd say if you're making like 2 or 3 +1/+1 counters, you can kind of think of that as being worth about a card. In a defensive deck, maybe more like 3 or 4 +1/+1 counters would really be worth a card.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">So you do want to be getting value out of the second and third chapters, like significant value. If you're, again, just making an 0/4, it's pretty bad, but if you're getting stuff out of the other chapters, it gets good quick. So clearly a card that wants to be in defensive decks, very high ceiling, but a pretty realistic, like not very low floor, as long as you're playing a defensive deck and have some reason to expect that non-creature non-land permanents are going to end up in the graveyard, and that means that you're going to have some of them in your deck. So I did discuss Builder's Talents some when talking about Black-White, and I highlighted that it's really good with Carrot Cake.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">And I kind of talked about using how many Carrot Cakes do I have as kind of the baseline for should I get into Builder's Talent. And the more I think about and play with it, the more it's like, yes, Carrot Cake is the best common to pair with it, but it works with a lot of different things, and I don't think you strictly need to be doing Carrot Cake, and I think if it's somewhat early in the draft or if you have some amount of support for it, it's fine to just take it and plan to draft around it. The other most important common, I think, is Fountainport Bell. That's the one mana artifact that allows you to, if you wish, search your library for land and put it on top, basic land,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and then you can spend one mana and sac it to draw a card. I think this card is pretty misunderstood. I think it's very good, and I think that you can safely cut lands for bells just one to one. Like, I've seen people look at my decks and say, \"Oh, you're only playing 15 lands in this deck.\" Well, I'm playing two bells, so to me it's a 17 land deck. I think that for your first roughly three bells, maybe even more than that, you can pretty safely just think of it as a tapped land.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Like, if you keep an opening hand with a land and a bell, then you, on turn one, play the land and cast the bell, so you don't get to use mana with your other thing, so that means that your first land functionally came into play tapped, and the second land, like, you draw a land and then you play it and it's untapped, and now you have two mana on turn two, so it's the same as if your hand actually had two lands. Now, you are down your second draw step, right? Like, you had to draw a land instead of drawing something else,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and so if that had just been a land in your hand and you were looking for your third land, then you're like one card less far toward finding your third land, so it theoretically costs you something in your ability to hit your third land compared to having a hand with two lands, except that when you sack the bell, you get that drawback. So you're like kind of down a second mana toward developing, but only if you have to spend that mana at an inconvenient time to make that development happen. So, like, there is a very, very small fringe cost in terms of it being, like, a little bit more, like, halting to your development than a tapped land, but it's really trivial. So the big concern is, well, what if you have a hand that you would heap,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but you have to mulligan because you don't have a land and you only have bells, or you just have too many tapped lands because you have too many bells and the cost to sacrifice them to get your cards back becomes significant. Like, an opening hand with two bells could be pretty awkward. So with three bells in your deck, you're just over seven percent to have two of them in your opening hand. At four, it's up to thirteen. I think at seven, I'm not really worried about it, especially since that's not, like, seven percent to have two bells and no lands, that's just seven percent to have two bells at all, and if you have, like,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">two bells, a land or two, and some other spells, like, not a big deal. But there is admittedly some risk once you get into crazy numbers of bells. The advantage that you get for playing bell, like, compared to, say, an actual tapped land that gives you any color of mana, like Uncharted Haven, is that you get an extra non-creature spell cast, which could matter for prowess stuff, like some of the otters have triggers on casting non-creature spells. It's an extra card in the graveyard for threshold stuff and foraging, and it's an extra non-creature permanent for builder's talent. And most importantly,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">it is basically like an Uncharted Haven with cycling too. If you don't want it to be a land, you can just cast it, not search, spend a mana, sacrifice it and draw. And, like, a land that is Uncharted Haven but it has cycling is really good. Like, Fountainport Bell is, I think, wildly underrated in decks that are not splashing. It's not that, like, all two-color decks want to play it or prioritize it, but it's very reasonable to play in a two-color deck if you have any sort of other synergies with it. So Bell good, Bell very good with builder's talent,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and then if you're prioritizing Bell to have ways to trigger your builder's talent, you will incidentally be able to splash extra colors pretty easily, which is particularly relevant because builder's talent positions you to be playing a long game, which means that you're going to be in a better spot to splash in general, and you're going to have time to find your lands and your payoffs for splashing. So, and then this will expand the range of good non-creature permanent, non-creature non-land permanents that you have access to in your builder's talent deck, or just give you more removal or whatever your control deck happens to need. So Bell and Carrot Cake are some of the main commons to be looking for, but there are some others, but I'm going to set that aside for a sec,</p>",
                "title": "builder1",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "[Intromusic]Hieveryone,thisisSamBlackwithDraftingArchetypes,andtodayI'mgoingtobediscussingabitofawei",
                "level": 1,
                "publishTime": "2024/08/24",
                "readingNum": 2,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "e30022f805ea44269612cde5d2b4fb7f"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}