{
    "props": {
        "pageProps": {
            "query": {
                "id": "e984e199eced4d3b8ed5fafd36967278"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 85854,
                "outId": "e984e199eced4d3b8ed5fafd36967278",
                "articleOutId": "e984e199eced4d3b8ed5fafd36967278",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">These are five Duskmourne draft lessons that you can apply to future formats.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">First up, be wary of finicky archetypes.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">One of the new archetypes in Duskmourne was a black/white reanimator deck, and in limited it was just a little bit too finicky to come together consistently. You needed a big creature in the graveyard, a card like right of the moth to get it back into play, and also oftentimes you needed a way to get that creature into the graveyard in the first place. So assembling all of those things was much more difficult than, say, playing a red/green delirium deck where you're playing already strong cards, getting to use the powerful synergy that you get in the late game from delirium,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and not really having to go out of your way to enable it because it just had strong support and individually good cards that were strong early but also really good later when you did have delirium enabled. Now there are some finicky archetypes like black/red sacrifice, which also was able to get there in Duskmourne, so this isn't to say you can't draft a deck that requires some A+B combos, but one of the things about the black/red deck is it had some built-in power level already from just getting to play black cards and red cards that were already good, and then some of the sacrifice stuff tacked on top of that was just added bonus because the cards that you needed to sacrifice or some of the enablers were already in the set as strong cards. So be wary of the finicky archetypes, but definitely keep an open mind because sometimes they can get there. It's just they're a lot less consistent than the ones that just play good cards.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next is card advantage still matters.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Now in recent Magic the Gathering sets there have been lots of cards that have card advantage tacked on, but they are still important and are still some of the best cards in the set. A card like Clockwork Percussionist performed excellently in this set because if you can ever trade this off and get a card out of it when it exiles it, that's a really good deal for one mana. There's also the card Glimmerburst, which is a card draw spell which has been fallen by the wayside a lot of the times because of all the card advantage in recent formats, but it makes a 1/1, it triggers some enchantment synergies, it's still worth playing and is still quite good in the format, and card advantage can help you pull ahead in the mid-game battles that often do ensue. And then a card like Spineseeker Centipede,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">which is a 3 drop that impacts the board and gets you a card is just absolutely fantastic, and getting a land of any color is really really good and ties into</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">my next point, which is always be aware of the mana fixing.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Duskmourne was a set that had really really good mana fixing and it showed. Cards like Terramorphic Expanse and Peculiar Lighthouse, which was part of a 10 card cycle of each of the color pairs, meant that you had access to lands that you could just put in, slot in instead of basics, and make your mana better, which was not only good for two color decks in terms of increasing their consistency, but also helped with splashes.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Knowing how good the fixing is is really important, especially if you open a card like the Swarmweaver and need to know how likely that card is to make your deck. In this case, the Swarmweaver is one of the best rares in all of Duskmourne, so if you open this pack one pick one, you should definitely slam it, because even if you don't play black green specifically, if you're just playing a green deck, you can oftentimes just get a couple of black sources into your deck to splash the Swarmweaver, because it is super powerful and there is ample fixing available. Now, if you're playing a black deck,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">it may be a little bit harder to splash, because you might not get to have access to greens fixing, but it is still doable in this format because there are those lands that we talked about. So knowing the fixing really does help you out in these trickier situations when you open up those complicated cards or need to know how likely it is you are able to splash.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next, good cards are good on the draw.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">In Duskmourne, this was readily apparent, because there were some archetypes that were built to be successful on the play, and they struggled mightily on the draw. A card like Bed Head Beastie, first off, is not really the sort of thing you want to be playing in today's era of Magic the Gathering.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Two-man at a mountain cycle, obviously, on the draw, is just the sort of thing that just doesn't affect the board. In the late game, you will generally have better things to do. So this is not the sort of effect that you want to be playing in modern eras of Magic a lot of the time, unless you have specific circumstances that require it. Now, the card I was referring to in terms of the mechanic that rewards you for being on the play is, of course, the survival mechanic. Acrobatic Cheerleader is a great example of this, because if you're on the play and able to have it survive combat,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">then you get to have a 2/2 flyer, which is definitely a nice card. But if you're on the draw, you're less able to attack. You might have to block with this, and in the mid-game, when the game is stalled, Acrobatic Cheerleader is just basically a vanilla 2/2 for two mana, which is really not good enough in today's era of Magic the Gathering. You can still play it, which is why it doesn't have the red X like the bedhead beastie, which is often best avoided, but it's the sort of card that you can think, \"Oh, this card is going to be a 2/2 flyer for two,\"</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but it only really does that on the play in very specific circumstances, and you need to be aware of that. A card like Innocuous Rat is pretty much going to do the same thing on the play or the draw. It's going to gum up the board, it's going to trade for something or chump block for something, and then it's going to get you that little manifest. And on the draw, it might even just be like the speed bump you need to help stabilize. On the play, it doesn't really apply pressure the same way, but a lot of the times you have a natural advantage from being on the play,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">so you want to make sure that some of your cards are going to be good on the draw. And then of course, a card like Scorching Dragonfire isn't a fair comparison to those other cards because this is one of the best commons in the set, but it is obviously fantastic on the draw, because if your opponent is curving out, they play their 3-drop, and then you only have 2 mana available on the draw, you can sometimes just end of turn kill their 3-drop and then untap and be the first one to affect the board. So Scorching Dragonfire, great on the play, great on the draw, but having these cards that are good on the draw is really, really important.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">And that is oftentimes one of the qualities you should look for in a great card when you're evaluating cards for a fresh format is, can this card help me on the draw?</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">Next, tokens are good even with no payoffs. Now, the card Gremlin Tamer goes into the blue-white deck, which has an enchantments theme, so it's going to be able to trigger and get those 1/1 tokens, but it doesn't really have a go wide theme or a way to buff up all your tokens at once or things of that nature, but those tokens are still valuable just by affecting the board, putting power and toughness into play. You don't need to be a tokens deck for this sort of card to be good.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">And the real card that brings this to mind is Midnight Mayhem, a card that was sometimes hard to see on first reading it before getting to play with it, how good it would be because you might think, okay, four mana for 3/1/1s that actually isn't the greatest stat line. Four mana, 3/1/1s, that's like a four mana 3/3, that's not the best, but having the power and toughness spread across three bodies is really nice. It plays really well with equipment or other things that buff your creatures and also Midnight Mayhem having that haste and life link and menace ability to push some damage out of nowhere was also quite helpful. But generally just making a bunch of bodies for one card is something that shouldn't be slept on even if you don't have tons of synergy to go with those. Now, of course, there were some synergy pieces in Duskmourne that could play well with the tokens,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">but a lot of the times you didn't even need those to make Midnight Mayhem or other token makers a good card. And so just keep that in mind going into future sets. That's going to do it for this video. Thank you so much for watching. If you made it to the end, leave #DuskDysiple to let me know you made it all the way to the end. That's going to do it for this one. I hope you enjoyed it and I'll talk to you next time.</p>",
                "title": "DSK 5 Lesson",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "ThesearefiveDuskmournedraftlessonsthatyoucanapplytofutureformats.Firstup,bewaryoffinickyarchetypes.O",
                "level": 1,
                "publishTime": "2024/10/31",
                "readingNum": 6,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "e984e199eced4d3b8ed5fafd36967278"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}