{
    "props": {
        "pageProps": {
            "query": {
                "id": "f70cd1abca60442ba611632a0ab54a36"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82513,
                "outId": "f70cd1abca60442ba611632a0ab54a36",
                "articleOutId": "f70cd1abca60442ba611632a0ab54a36",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and that deck wouldn't want Bell, because I'm usually playing a creature on turn 1. But if you have a more normal limited curve where you don't have very many 1 mana creatures and you're mostly things that cost 2, then I think it's very reasonable to play Bell in a two-color deck basically just as a cycling land/like using, you know, a tapped dual land or whatever. Strike force is a reasonable callout specifically as a creature that's particularly valuable to put counters on. That's the 1/3 flying double strike vigilance. Certainly, you know, I said in general that you shouldn't be, like, really worrying about the keywords as much as, like, just getting more triggers.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">I'm not like... colors are kind of a secondary consideration. It's more just take whatever cards would be good for what you're doing, and because you have spells or other fixing and you're playing a very long game and seeing a lot of cards, you can make the mana work out. So I do a lot of like, splashing gold rares that, you know, where they're the only card of one of their colors, and it all works out pretty smoothly. So that's what I'm thinking about when I'm drafting around Builder's Talent, so I'm going to turn it over to chat for comments and questions. While I'm waiting for that, I do want to direct everyone to patreon.com/draftingarchetypes if you're interested in checking out benefits and supporting a podcast.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">\"Would I try to get creatures with keywords, since growing them is more impactful?\" Yeah, I mean, so any time you... great thing to be thinking about. Any time you're putting +1/+1 counters on things, the value of those counters is magnified based on the keywords that they're being attached to. I definitely want defensive keywords, so I'm not all that interested in keywords like \"trample,\" but I'm pretty interested in keywords like \"reach\" and \"flying,\" because a lot of what's happening here naturally comes up the ground pretty well, but I want to make sure that I don't die to fliers.</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">If you could get some counters with lifelink, that's pretty nice. And in general, I think... I'm more focused on getting more counters than putting them somewhere higher value, which is why I didn't put a lot of stock in putting them on fliers, but it is a nice thing to look to do. Like, Builder's Talent does play very well with, like, Plume Creed Mentor. I think that's the name of the Blue-White Mentor, the 2/3 flyer that puts a counter on a non-creature... or, I mean, on a non-flying creature, because, you know, you play the Builder's Talent and you get an 0/4,</p> \n<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">and then you can put a counter on it and get your bird, and then you have a good blocker on the ground and a reasonable blocker/attacker in the air, and then you can get more, you know, counters with either of your cards. But, some extra value, but I don't think it should be your primary focus, is basically where I'm at with keywords there. I said that \"Bell is a reasonable playable and a two-color deck with any synergy. What if you have no synergy? I've been happy with the first Bell regardless of what my deck looks like.\" Yeah, I think as long as you're not, like, hyper aggro, like, I earlier today was playing a red-white 15 land deck that was basically all 1 and 2 mana spells,</p>",
                "title": "builder3-2",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "andthatdeckwouldn'twantBell,becauseI'musuallyplayingacreatureonturn1.Butifyouhaveamorenormallimitedc",
                "level": 1,
                "publishTime": "2024/08/24",
                "readingNum": 2,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "f70cd1abca60442ba611632a0ab54a36"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}