{
    "props": {
        "pageProps": {
            "query": {
                "id": "fb31deb83d5240cab86c471144c1a764"
            },
            "ieBrowser": false,
            "needRefresh": false,
            "writingDetail": {
                "id": 82449,
                "outId": "fb31deb83d5240cab86c471144c1a764",
                "articleOutId": "fb31deb83d5240cab86c471144c1a764",
                "html": "<p data-tool=\"mdnice编辑器\" style=\"color: rgb(0, 0, 0); font-size: 16px; line-height: 1.8em; letter-spacing: 0em; text-align: left; text-indent: 0em; margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; padding-top: 8px; padding-bottom: 8px; padding-left: 0px; padding-right: 0px;\">[35:05.720]- All right, can we cook? [35:06.800]- We can cook, let's do it. [35:07.920]- Okay, so we gotta talk about, [35:10.280]and this is gonna be a nice companion to I think what we're gonna do next week, [35:14.400]but I won't tease that just yet, but my favorite card in the format, [35:19.540]bar none, is Builder's Talent. [35:22.160]- Whoa, we got 'em, folks! [35:23.760]- I cannot get enough of this card, [35:25.940]this is the one in a white class enchantment, comes into play, [35:29.790]and you get an O four, level it up for a single white, [35:32.740]and whenever a non-creature, [35:33.740]non-land permanent enters the battlefield under your control, [35:36.420]you put up almost one counter on a creature, [35:38.020]and you can pay four in a white to return a non-land, [35:41.050]non-creature permanent from your graveyard to the battlefield. [35:44.860]This card rules, this is just like, it's such a sweet card, [35:51.980]and I really have gotten a chance to play with it a lot, [35:54.820]and it is also like, to my detriment, [35:57.980]like I started doing the thing where I'm like, [36:00.180]building Builder's Talent decks, I'm like literally building it, [36:03.060]hoping-- - Before you see Builder's Talent. [36:04.740]- Hoping that Builder's Talent comes around, [36:07.100]and sometimes it does-- - Like me in the streets of Nuka Pena, [36:09.060]big score era, I just knew I was gonna get past the big scores. [36:12.220]- It's totally true, yeah, [36:13.220]but it doesn't quite work out when it's the uncommon, but I did, [36:17.020]but sometimes when they're opened, and no one at the table wants them, [36:22.660]you can't, like I got four of them in a deck earlier this week, [36:26.920]and it's so sick. [36:27.900]So here is what you want to do with Builder's Talent. [36:30.740]The cool thing about the card is, [36:32.180]and we'll talk about a lot of other different things to do, [36:34.380]but I think this is like the coolest or best way to cook in the format is with this card. [36:39.540]It's best in a bant shell, but every color adds something to the mix. [36:44.940]So the best card, and I shouted this out in the draft, [36:48.420]that has gone up for me is Sticky Tongue Sentinel. [36:50.460]That's the two in a green three three reach, that picks something up, [36:53.620]or you can't pick something up when it comes into play. [36:56.500]This is just so cool. [36:59.940]It's great with the talents, and the talents that we'll, [37:03.300]as we'll talk about later, like they're almost all, [37:06.870]all of them have moved up for me. [37:08.340]Like they're all really sweet, even though like I said, [37:11.260]I haven't quite done Bandit's Talent yet. [37:14.180]I am playing a deck with Gossip's Talent right now. [37:16.540]I know some people have had success with that, [37:18.420]even though I think it's a little clunky-ish. [37:21.540]That's the one in a blue one that your creatures surveil when they come into play, [37:25.620]and then you can make something Power 3 or less unblockable, [37:28.740]and then you can, the third level lets you, once a creature connects, [37:33.650]you can blink it. [37:34.700]But you can do it to any creature that connects. [37:36.980]So if you connect with two or three, you can blink all of them, et cetera. [37:40.060]Anyway, so Sticky Tongue Sentinel, [37:42.580]it really does harken back for me with the class enchantments, [37:48.300]with picking up sagas in Neon Dynasty. [37:51.220]It's like the exact same thing. [37:52.940]And it's really powerful. [37:55.000]Like getting to, [37:57.000]especially if you're going really deep with Builder's Talent, [38:00.240]like getting to cast Builder's Talent, level it up all the way to three, [38:04.620]you've gotten something back, [38:06.340]then Sticky Tongue Sentinel is picking up Builder's Talent, [38:09.020]you're replaying it, getting another O4, [38:11.740]getting to rebuy the thing again from your graveyard, et cetera. [38:15.580]It's really, really good. [38:16.460]So that's, I think you at least want to be splashing it. [38:20.500]- The other reason that green adds so much with Sticky Tongue Sentinel specifically is the deck can gum up the ground easily. [38:29.760]You can get overrun by flyers a lot. [38:32.020]And the reach from Sticky Tongue Sentinel adds a lot of defense to the deck. [38:36.980]And maybe you need a counter on it, right? [38:39.260]But Builder's Talent is there to get up to a 4/4 so you can block the Glide Dive duos, [38:44.120]et cetera. [38:45.100]- I think even outside of cooking with Builder's Talent, [38:47.740]Sticky Tongue Sentinel is probably the green card that I've gained the most respect for over the last week and a half or so. [38:53.100]Like just the body is so solid. [38:55.460]Also, if you're not cooking and you're just playing with good cards, [38:57.980]like just getting over when you pick up Hunter's Talent, [38:59.820]like it's just stupid. [39:00.820]I hate Hunter's Talent so much. [39:02.700]- I do think it's a little too OP. [39:04.000]I mean, I like the card 'cause it's very powerful, [39:07.020]but I think it's a little too egregious. [39:09.380]Yeah, like the draft log, I think, [39:11.020]was it last week that we went over where I could have picked a Sticky Tongue Sentinel second following up on Hunter's Talent and I didn't. [39:17.420]I was like a little too early to take that card. [39:19.420]I think now I do not think that. [39:20.980]Now I just be like, no, I'm good. [39:22.460]I'll just lock up this synergy and this good reach blocker right now. [39:28.380]So the next thing you want to really take advantage of Builder's Talent is the creatures that will wear the counters well. [39:37.060]And so white has one major one in my mind is Strike Force. [39:41.580]That's the two in a white one, three, flying double strike vigilance. [39:45.780]- Vigilance. [39:46.820]Why does it need vigilance? [39:48.660]- It's like the moose, like why? [39:49.900]What are we doing here? [39:50.780]- That gaining counters just is gonna end the game in a hurry. [39:53.940]And the other thing I realized this week is blue's unblockable creatures. [39:58.260]That's why I like Bant for Builder's Talent. [39:59.980]Blue's unblockable creatures wear the counters so well. [40:02.940]So obviously Shoreline Looter is a card we like a lot, but one in a blue. [40:06.220]One, one, can't be blocked. [40:08.040]If you don't have threshold, it's a looter when it connects. [40:12.260]And if you do, it just draws a card when it connects. [40:14.940]That's great. [40:16.820]Then you get last pick Nightwhirl Hermits, the two in a blue, one, four, [40:21.080]which has vigilance, I believe. [40:23.900]And when you have threshold, it gets plus one, plus zero, and unblockable. [40:27.620]So you're playing the long game anyway. [40:28.940]Your deck is already interested in a three mana, one, four as a blocker. [40:32.980]And then at a certain point, you're just like, oops, here's a five, [40:37.170]eight vigilance unblockable ending the game in a hurry. [40:40.940]And that goes back to my point about a lot of these, [40:45.600]like a big factor for a lot of these decks or strategies is unlocking the wheel and making use of late pick cards. [40:51.220]And when you get pick 12, 13, 14 Nightwhirl Hermit, and then you're like, [40:55.790]oh, dang, [40:56.400]this is actually gonna be an ace for me at some point in the game. [41:00.040]It's very powerful. [41:01.300]- But this is also why, not to poo poo here, bring down your vibe, [41:05.900]but this is also why the deck is not tier one, [41:08.580]because you're playing Nightwhirl Hermits in a format where green black is just insanely powerful. [41:15.180]You know? [41:16.020]- I agree. [41:17.140]I mean, I do think like of the things we're gonna talk about today, [41:19.320]I do think this is like, I think this deck has real legs. [41:23.220]Like again, I don't know, [41:24.060]like best version of this versus best version of the actual decks you're supposed to be drafting the format. [41:30.740]No, those probably went out, but this is like tier 1.5 in my mind. [41:34.180]Whereas I do think some other stuff we're gonna talk about is like tier two. [41:37.020]- True. [41:37.860]- Instant speed ways to make food is important because that turns once you get builder's talent up to level two, [41:45.520]that turns these into combat tricks. [41:47.180]So like- - Yes. That's where it's scary playing as builder's talent. [41:50.820]- So like paw patch formation, the one under green can blow up a flyer, [41:55.260]an enchantment or make a food draw card. [41:57.860]Cash grab, [41:58.700]you wanna make sure you have like some ways to take some squirrels. [42:01.500]We'll talk about the changelings as well, 'cause sometimes you do, [42:04.500]you do get into some looping territories here and you may want a two, [42:08.580]three reach that can stack the bottom of your library. [42:11.820]Savor is excellent here. [42:13.220]That's the thing that black adds to the deck really well is Savor as a cheap removal spell, [42:18.200]plus giving you that food instant speed. [42:20.500]The thing that the cash grab does that's so great is that when you have multiple builder's talents, [42:25.900]you've been a builder's talent and then your builder's talent that you have in play can get it back, [42:31.900]right? [42:32.220]Because level three lets you get back a non-creature non-line permanent and then you're just cooking. [42:37.980]- We'll say of all those cards, paw patch formation is just, I think, [42:42.300]an include in most green decks in the format. [42:45.160]It just is very good in blowing up the talents. [42:47.720]Having a card that can blow up the talents while not costing you that much. [42:50.580]- And banishing light. [42:51.700]- Right, and potentially being synergistic is strong. [42:55.180]And then the other thing that's wild about cash grab, [42:57.540]I don't know how I went this far in the format without realizing this, [43:00.540]'cause I have played green a lot. [43:03.780]I did not know cash grab had the text that if you didn't have a squirrel in play, [43:09.180]if you pulled a squirrel out of your yard, you still get the food. [43:12.540]I was playing sealed yesterday and my opponent had no squirrel and made a food and I was like, [43:16.720]whoa, what happened here? [43:19.700]And then I read cash grab more closely. [43:21.980]I just always had nuts squirrels decks and I value bone cash overseer really highly. [43:27.380]So I've always bone cash overseer cash grab or not realizing it, [43:32.200]I have saved my cash grabs till post squirrel. [43:35.700]- Till you had a squirrel, wow. [43:38.580]I was already super high on cash grab and just playing it suboptimal. [43:42.220]- If you end up pairing with red, which I think is the least likely, [43:46.620]blacksmith's talent is a way to double trigger builder's talent. [43:50.740]And again, like leveling up blacksmith's talent. [43:54.180]Like you could end up in a jest guy life where blacksmith's talent pairs really nicely with the counters from builder's talent and your blue unblockable creatures as well, [44:05.860]getting the double strike equip, et cetera. [44:08.340]And then lastly, the colorless cards, [44:09.860]bumble flower share pot is just paramount. [44:13.180]Like you have to have one copy in these decks because it gives you a removal spell that you can buy back and it double triggers builder's talent. [44:20.040]And fountain port bell is great. [44:21.280]You're gonna wanna be splashing in these decks and this is just like a cantrip for you to get back. [44:26.940]And it's like basically a land, right, [44:29.580]that triggers your builder's talents. [44:32.180]- In classic Lords of Unlimited fashion, [44:34.620]I was very high on this card in our set reviews. [44:37.780]You were very low on it. [44:39.380]And I have yet to play with builder's talent. [44:43.060]- It's like, I mean, I've been playing a lot on my phone in this format, [44:46.150]so it's not quite an accurate sample. [44:48.460]But builder's talent is I believe in my top 10 drafted cards in the format. [44:52.540]Like I just don't pass it right now 'cause it's all I want to be doing. [44:57.080]So that's my outline for builder's talent specifically. [45:00.560]And now I wanna just talk about the talents in general. [45:03.660]Like, so there's some other cooking to be done. [45:06.580]Like I said, I haven't quite done the bandit's talent discard deck, [45:10.840]but I do think there's something there even outside of the attrition war you were talking about in Sealed. [45:17.600]I don't know quite what it is. [45:19.660]I don't know quite how you just don't die to stuff on board when you're doing bandit's talent and ruthless negotiation and psychic worlds. [45:28.200]But the fact that all of that exists, [45:30.220]like you really can grind people out with bandit's talent than accruing that card advantage for you. [45:37.540]- Yeah, I mean, [45:39.170]I certainly am much more skeptical of bandit's talent in draft than I am in Sealed. [45:43.720]- Yeah. [45:44.560]I haven't quite gotten this, but artist talent burn. [45:49.300]I had this opportunity. [45:51.260]- Are you listening to yourself right now? [45:53.660]- What? [45:54.500]- Artist talent burn in Bloomberg. [45:56.780]Get out of here. [45:57.940]- Well, so I could have had this, but someone, I don't know what, [46:01.860]they rare drafted or whatever. [46:03.200]I should have gotten this in a good, in a red, [46:05.880]this was basically mono red burn deck. [46:07.640]And so this is the talent that-- - On the wheel? [46:09.320]- I should have gotten it on the wheel. [46:10.240]Like no one should be-- - On the wheel you got greedy? [46:12.320]- No one should be playing that card. [46:13.660]I should get it. [46:14.500]But so that adds two, [46:17.120]it's level three adds two damage to non combat damage that you do. [46:21.420]And there's a lot of like turning your playful shoves into deal three draw card, [46:26.200]blooming blast dealing five when you gift the treasure, [46:29.640]kindle spark duo tapping to deal three. [46:32.560]- Yeah, [46:33.250]and how exactly are you remotely responsibly getting into this deck? [46:38.640]- Oh, that I don't know. [46:39.600]Like the way I did, [46:41.090]which was like getting into a red spells deck and then hope, [46:44.520]like artist talent getting open. [46:46.180]This is, that's a bit of a meme. [46:47.740]Scavengers talent though, have you played with this card? [46:50.400]This is the black rare. [46:51.800]Whenever something you control dies, you make a food, [46:54.940]only triggers once a turn. [46:56.500]Level two, whenever you sack a permanent, you mill two cards. [46:59.720]Any target player mills two cards. [47:02.100]And then level three says in your end step, [47:04.280]you can sack three non land permanents and then you get to bring back something with a finality counter on it from your graveyard. [47:11.200]Scavengers talent mill is real. [47:13.720]- Yeah, scavengers talent is sick. [47:15.040]It unlocks a whole archetype. [47:16.820]It's one of the few build arounds in the format. [47:18.600]But again, like it's not great. [47:21.440]- Oh, I think it is actually great. [47:24.040]The problem with it is that it's best in the best deck. [47:27.680]Like it's just best in, like you're in a black green deck and you have it, [47:31.970]you're just like playing it. [47:33.660]And then, [47:34.500]'cause the thing that happens with the card is you're doing some attritiony stuff and then all of a sudden you're like, [47:39.860]oh, I just mill you in two turns. [47:41.680]- Yeah. - Yeah. [47:43.440]And I think black green does that really, really well. [47:46.640]Let's talk about red black as a spells or control deck. [47:50.680]I had an opportunity to play this as a control deck earlier this week and was really impressed. [47:56.680]- Yeah, [47:57.230]I also drafted one in the finals right now in a best of three traditional with it. [48:01.440]I haven't played the last match yet. [48:03.080]- Speaking of cards in classic Lords of limited fashion that I believe I gave it an F and I actually kind of liked it in this deck. [48:10.240]I played a hoarder's overflow. [48:12.160]- Oh, really? [48:13.960]- For the first time. [48:13.960]Well, so the red black decks, they need card advantage in some form. [48:20.040]And you would like that to be, I think, stargaze. [48:22.680]But stargaze can be a little dicey because unlike in black green or black white where you're mitigating life loss from stargaze with your food or your life gain synergies in white, [48:34.840]red black doesn't have that. [48:36.520]And so you can be in a spot where you're like, I'm stable, [48:40.180]I wanna pop off with my card advantage spell, [48:43.280]but I don't really wanna go to like for life or whatever. [48:47.240]And hoarder's overflow I found like pretty easily as it just drew me four cards in all the games I casted in this deck. [48:55.600]So again, [48:56.220]this is the one in red enchantment when it enters or when you expend four, [48:59.640]you put a counter on it and then you can pay one on a red to sack it, [49:02.600]discard your hand and draw cards equal to the counters on it. [49:05.380]And I also found that Mind Drill assailant as Wish Coin Crab Plus was really good for the deck like just as roadblock mana sink for card selection at some point and then potential like, [49:20.660]a five five does tussle with the green decks, formidably. [49:24.760]- Yeah, [49:25.240]I've also liked red black spells and it's similar to blue black in the sense that both the decks essentially have the same game plan, [49:31.080]which is play out like a control deck and red gives you instead of blue, [49:35.220]like blue gives you some card advantage and just good blue cards that you're likely to get late. [49:40.140]The red gives you like, if people aren't getting the red in your pod, [49:43.520]red gives you the cheap interaction like take out the trash and Agata Salt, [49:47.560]take out the trash being better, but you'll play some Agata Salts as well. [49:49.960]Like if you're getting those cards late, [49:52.240]like the way to get into the deck in my experience, limited albeit, [49:55.870]but it's similar to blue in that you start heavy black and then you cherry pick the best red spells and it also gives you Coruscation Mage, [50:03.800]which is pretty sweet as like a non attacking way to finish out the game. [50:08.460]That's the one in a red two two that's got offspring and each one of the creatures, [50:13.920]whenever you cast a spell pings your opponent, [50:15.700]which also in this version of red black lets you play the cards, [50:19.840]specifically like the red, [50:21.240]black red uncommon that gives you card advantage whenever your opponent's lost life. [50:25.260]It lets you trigger that life loss without having to duke it out in combat, [50:30.200]which is kind of cool. [50:32.020]But then again, like you said, with Hoarders Overflow, [50:34.200]you need stuff like Starfall. [50:36.120]This is the best home I think for Dire Sight outside of white black and Dire Sight has done well here for me and even Sinister Monolith as a non creature spell to trigger Coruscation Mage and things like that. [50:47.380]I think this is a good home for that as well, [50:49.620]but it's more of a classic control deck that you get into by starting deep in black and then getting good red cards late. [50:56.620]- Another shout for Fountainport Bell is that it's like a land, like yeah, [51:01.370]it triggers your builders talents, [51:02.540]but it's again like a land air quotes that triggers those cards too. [51:06.060]It triggers your Coruscation Mage, it triggers your Kindle Spark duos. [51:09.340]I noticed you didn't mention Kindle Spark duo in your run of cards here. [51:15.020]Are you still not a believer? [51:17.140]- I am not a believer. [51:18.060]Do you like that card? [51:19.460]- I mean, I like it. [51:22.420]It's terrible. [51:24.220]A one three is such a bad body in the format. [51:26.780]- So speaking of it being a bad body, [51:30.220]what makes it a better body is Patchwork Banner. [51:33.900]And I'll tell you where Patchwork Banner is I have been most impressed by is Blue Red. [51:40.100]Turning your otter, like it solves the problem that Blue Red has, [51:43.860]which is that Blue Red is like, hey, can you just give me a sec? [51:47.320]I'm gonna play my two mana one ones and my three mana two twos. [51:49.940]And Patchwork Banner says, hey, I'll trigger those, [51:53.180]plus I will give a permanent buff to those cards. [51:56.220]And all of a sudden, [51:57.300]your otter ball antics is making a two mana two two with Prowess and flashes back. [52:02.700]A three three with Prowess. [52:05.060]And that is a lot better. [52:06.020]Plus, Patchwork Banner triggers all of that non-creature stuff. [52:09.020]So I've drafted Blue Red a few times and I've found it to be like, [52:12.740]and once again, this is not a good deck, [52:14.420]but I think-- - You were really selling folks here. [52:19.340]- I just wanna put the caveat on, it's just like, you're gonna, I think, [52:25.060]especially if you're drafting, maybe not in the best of one ladder, [52:27.800]but if you're drafting in any kind of competitive pods, [52:30.460]you're gonna have to draft Blue Red at some point. [52:33.660]- Yes. - And you're gonna wanna know how to draft it. [52:36.460]And I think Patchwork Banner's really important in those decks. [52:39.100]And it feels to me like, you remember drafting Blue Red in OTJ? [52:43.460]And it was just like, no one wanted to touch it. [52:46.200]And so the pods where three or four of the Blue Red rares were opened, [52:51.080]you just got them. [52:52.560]Like you just get past, I got a pack one pick three Ral the other day, [52:58.000]and then I got past Alania. [52:59.760]And it was just like, okay, no one wants to draft Blue Red, [53:03.360]I'll draft Blue Red. [53:04.180]But then when the deck is so open, [53:07.600]you do need to know what the pieces are that really like, oh, [53:10.200]what do I need to do? [53:11.040]And so the two cards that I've been impressed by, [53:13.080]Patchwork Banner for sure is like, [53:15.440]you gotta have that in your Blue Red decks 'cause it makes your creatures big, [53:18.920]right? [53:18.920]Again, makes your Kindle Spark duos being two fours. [53:22.280]All of a sudden you're like, oh, that's not a bad card at all. [53:25.140]And leveraging Wildfire Howl has been very good here. [53:30.160]The one red red deal two to all creatures and you can gift a card to deal one damage to something and then two to all creatures. [53:37.800]- 'Cause that shores up your matchup against rabbits, [53:39.520]which is the archetype that that struggles with the most. [53:42.360]- Yes, exactly. [53:44.120]And a lot of the times those, because you have a lot of card selection, [53:49.110]card advantage, when it's bad, you can usually chuck it in some way. [53:53.600]And so I just found that I really wanna make sure I have access to a copy of that in Blue Red. [53:59.740]- You're selling me on Patchwork Banner. [54:01.200]That makes sense because when you get that deck also, [54:03.680]you're likely to get all the otters because nobody else wants them anyway. [54:06.800]So you're going to end up in that type of streamlined deck where Patchwork Banner's great. [54:10.360]- Yeah, correct, yeah. [54:11.440]- Yeah, it makes sense. [54:11.440]- I mean, it's unlike, again, [54:12.880]Patchwork Banner is a card that is gonna be contested. [54:16.840]But so if you find yourself in Blue Red and you're opening up a pack that has Banner versus Red removal spell, [54:23.160]I think you'd just be inclined to be like, \"Oh, [54:24.740]I should take take out the trash.\" [54:25.960]And I would say, \"No, [54:27.680]you really wanna make sure \"you have Banner in that deck.\" [54:30.280]- Yeah, I buy it. [54:31.560]- I was trying to have another category here of once I have two of these, [54:36.280]my pick order changes 'cause I was kind of inspired by having two jolly durbels in a draft earlier this week. [54:43.520]And that's the one in a white two, three, [54:45.160]that whenever you gift something, you draw a card. [54:47.480]And I've been impressed by this on the other side of the battlefield as well. [54:50.260]And I just couldn't find other cards that fit this category of like, [54:54.440]\"When I have two, I'm gonna start to mess around.\" [54:57.440]That I haven't already sort of listed in other categories here in this episode. [55:01.880]- I would say Eddy Merc Crab. [55:03.420]Once I get the second Eddy Merc Crab, I'm pretty interested in spells. [55:07.000]- Yes, I totally agree. [55:08.240]But that feels more like sign posty slash, that's just like, that's good. [55:12.800]That's like clearly what that-- - That's just good drafting. [55:14.260]- That's just good drafting, I would say. [55:16.040]And that's clearly like what that card and deck is doing. [55:19.060]But I guess it's, you could be blue red, [55:21.120]but you'd probably just prefer to be blue black with that. [55:23.960]- I would prefer to be blue black with that, yeah.</p>",
                "title": "BLB niche",
                "categoryId": 1,
                "categoryName": "后端",
                "tagId": 100,
                "tagName": "后端",
                "userId": 56870,
                "userOutId": "704721855690",
                "username": "TopDeckMTG",
                "avatar": "",
                "description": "[35:05.720]-Allright,canwecook?[35:06.800]-Wecancook,let'sdoit.[35:07.920]-Okay,sowegottatalkabout,[",
                "level": 1,
                "publishTime": "2024/08/23",
                "readingNum": 4,
                "likeNum": 0,
                "introduction": null,
                "followWords": null,
                "followPic": null,
                "isFollowing": false,
                "isLike": false,
                "isSelf": false,
                "type": 1,
                "isVisible": true,
                "invisibleReason": null,
                "writingColumn": {
                    "columnOutId": "32c6b1006569461a8b8f2ec6c5186534",
                    "name": "MTG Limited",
                    "briefIntro": "万智牌限制赛",
                    "cover": "https://files.mdnice.com/user/56870/column-cover/cd2949b2-fb90-46e2-8b1e-68421ba2ea65.jpg",
                    "writingNum": 16,
                    "createTime": "2024-08-12 20:44"
                }
            }
        },
        "__N_SSP": true
    },
    "page": "/writing/[id]",
    "query": {
        "id": "fb31deb83d5240cab86c471144c1a764"
    },
    "buildId": "ErZPkD4oq6iwH2nj6Dpcx",
    "isFallback": false,
    "gssp": true,
    "appGip": true
}